Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_TXHUBPORT_HUBPORT_Pos           _UINT8_(0)                                           /* (USBHS_TXHUBPORT) Hub Port Position */
#define USBHS_TXHUBPORT_HUBPORT_Msk           (_UINT8_(0x7F) << USBHS_TXHUBPORT_HUBPORT_Pos)       /* (USBHS_TXHUBPORT) Hub Port Mask */
#define USBHS_TXHUBPORT_HUBPORT(value)        (USBHS_TXHUBPORT_HUBPORT_Msk & (_UINT8_(value) << USBHS_TXHUBPORT_HUBPORT_Pos)) /* Assigment of value for HUBPORT in the USBHS_TXHUBPORT register */
#define USBHS_TXHUBPORT_Msk                   _UINT8_(0x7F)                                        /* (USBHS_TXHUBPORT) Register Mask  */


/* -------- USBHS_ENDPOINT0_CONFIGDATA : (USBHS Offset: 0x101F) ( R/ 8) ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected. -------- */
#define USBHS_ENDPOINT0_CONFIGDATA_RESETVALUE _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_CONFIGDATA) ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected.  Reset Value */

#define USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Selected UTMI+ DataWidth. Always 0 Indicates 8 Bits Position */
#define USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Selected UTMI+ DataWidth. Always 0 Indicates 8 Bits Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH(value) (USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Pos)) /* Assigment of value for UTMIDATAWIDTH in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Soft Connect Or Disconnect Position */
#define USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Soft Connect Or Disconnect Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE(value) (USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Pos)) /* Assigment of value for SOFTCONE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Dynamic FIFO Sizing Is Selected Or Not Position */
#define USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Dynamic FIFO Sizing Is Selected Or Not Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING(value) (USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Pos)) /* Assigment of value for DYNFIFOSIZING in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Pos  _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth TX ISO Endpoint Support Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth TX ISO Endpoint Support Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_HBTXE(value) (USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Pos)) /* Assigment of value for HBTXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Pos  _UINT8_(4)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth RX ISO Endpoint Support Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth RX ISO Endpoint Support Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_HBRXE(value) (USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Pos)) /* Assigment of value for HBRXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Little Endian Ordering Position */
#define USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Little Endian Ordering Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN(value) (USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Pos)) /* Assigment of value for BIGENDIAN in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Pos  _UINT8_(6)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Packets Is Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Packets Is Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_MPTXE(value) (USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Pos)) /* Assigment of value for MPTXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Pos  _UINT8_(7)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Amalgamation Is Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Amalgamation Is Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_MPRXE(value) (USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Pos)) /* Assigment of value for MPRXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_Msk        _UINT8_(0xFF)                                        /* (USBHS_ENDPOINT0_CONFIGDATA) Register Mask  */


/* -------- USBHS_ENDPOINT0_COUNT0 : (USBHS Offset: 0x1018) ( R/ 8) ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO -------- */
#define USBHS_ENDPOINT0_COUNT0_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_COUNT0) ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO  Reset Value */

#define USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINT0_COUNT0) Number Of Received Data Bytes In Endpoint 0 FIFO Position */
#define USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Msk (_UINT8_(0x7F) << USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Pos) /* (USBHS_ENDPOINT0_COUNT0) Number Of Received Data Bytes In Endpoint 0 FIFO Mask */
#define USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT(value) (USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Pos)) /* Assigment of value for EP0RXCOUNT in the USBHS_ENDPOINT0_COUNT0 register */
#define USBHS_ENDPOINT0_COUNT0_Msk            _UINT8_(0x7F)                                        /* (USBHS_ENDPOINT0_COUNT0) Register Mask  */


