Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_ENDPOINT0_CSR0H : (USBHS Offset: 0x1013) (R/W 8) ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0 -------- */
#define USBHS_ENDPOINT0_CSR0H_RESETVALUE      _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_CSR0H) ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0  Reset Value */

#define USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Pos   _UINT8_(0)                                           /* (USBHS_ENDPOINT0_CSR0H) Flush The Next Packet To Be Transmitted/Read Position */
#define USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Msk   (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Pos) /* (USBHS_ENDPOINT0_CSR0H) Flush The Next Packet To Be Transmitted/Read Mask */
#define USBHS_ENDPOINT0_CSR0H_FLUSHFIFO(value) (USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Pos)) /* Assigment of value for FLUSHFIFO in the USBHS_ENDPOINT0_CSR0H register */
#define USBHS_ENDPOINT0_CSR0H_Msk             _UINT8_(0x01)                                        /* (USBHS_ENDPOINT0_CSR0H) Register Mask  */

/* HOST_EP0 mode */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINT0_CSR0H) When Read, This Bit Indicates The Current State Of The Endpoint 0 Data Toggle Position */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Pos) /* (USBHS_ENDPOINT0_CSR0H) When Read, This Bit Indicates The Current State Of The Endpoint 0 Data Toggle Mask */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE(value) (USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Pos))
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Position */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Pos) /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Mask */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE(value) (USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Pos))
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Instruct The Core Not To Issue PING Tokens In Data And Status Phases Of A High-Speed Control Transfer Position */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Pos) /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Instruct The Core Not To Issue PING Tokens In Data And Status Phases Of A High-Speed Control Transfer Mask */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING(value) (USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Pos))
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_Msk    _UINT8_(0x0E)                                         /* (USBHS_ENDPOINT0_CSR0H_HOST_EP0) Register Mask  */

/* PERIPHERAL_EP0 mode */
#define USBHS_ENDPOINT0_CSR0H_PERIPHERAL_EP0_Msk _UINT8_(0x00)                                         /* (USBHS_ENDPOINT0_CSR0H_PERIPHERAL_EP0) Register Mask  */


/* -------- USBHS_ENDPOINT0_CSR0L : (USBHS Offset: 0x1012) (R/W 8) ENDPOINT0 Control And Status Bits for TX Endpoint 0 -------- */
#define USBHS_ENDPOINT0_CSR0L_RESETVALUE      _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_CSR0L) ENDPOINT0 Control And Status Bits for TX Endpoint 0  Reset Value */

#define USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Pos    _UINT8_(0)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Data Packet Has Been Received Position */
#define USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Msk    (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Data Packet Has Been Received Mask */
#define USBHS_ENDPOINT0_CSR0L_RXPKTRDY(value) (USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Pos)) /* Assigment of value for RXPKTRDY in the USBHS_ENDPOINT0_CSR0L register */
#define USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Pos    _UINT8_(1)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Position */
#define USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Msk    (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Mask */
#define USBHS_ENDPOINT0_CSR0L_TXPKTRDY(value) (USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Pos)) /* Assigment of value for TXPKTRDY in the USBHS_ENDPOINT0_CSR0L register */
#define USBHS_ENDPOINT0_CSR0L_Msk             _UINT8_(0x03)                                        /* (USBHS_ENDPOINT0_CSR0L) Register Mask  */

/* HOST_EP0 mode */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Received. Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Received. Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit To Request An IN Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit To Request An IN Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit At The Same Time As The TxPktRdy Or ReqPkt Bit Is Set, To Perform A Status Stage Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit At The Same Time As The TxPktRdy Or ReqPkt Bit Is Set, To Perform A Status Stage Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_Msk    _UINT8_(0xFC)                                         /* (USBHS_ENDPOINT0_CSR0L_HOST_EP0) Register Mask  */

/* PERIPHERAL_EP0 mode */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Transmitted. Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Transmitted. Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit 1. When Setting TxPktRdy For The Last Data Packet 2. When Clearing RxPktRdy After Unloading The Last Data Packet.3. When Setting TxPktRdy For A Zero Length Data Packet. Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit 1. When Setting TxPktRdy For The Last Data Packet 2. When Clearing RxPktRdy After Unloading The Last Data Packet.3. When Setting TxPktRdy For A Zero Length Data Packet. Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When A Control Transaction Ends Before The DataEnd Bit Has Been Set Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When A Control Transaction Ends Before The DataEnd Bit Has Been Set Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Terminate The Current Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Terminate The Current Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The RxPktRdy Bit. It Is Cleared Automatically Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The RxPktRdy Bit. It Is Cleared Automatically Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The SetupEnd Bit. It Is Cleared Automatically. Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The SetupEnd Bit. It Is Cleared Automatically. Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_Msk _UINT8_(0xFC)                                         /* (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0) Register Mask  */


/* -------- USBHS_CTHHSRTN : (USBHS Offset: 0x1346) (R/W 16) Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode -------- */
#define USBHS_CTHHSRTN_RESETVALUE             _UINT16_(0x32)                                       /*  (USBHS_CTHHSRTN) Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode  Reset Value */

#define USBHS_CTHHSRTN_CTHHSRTN_Pos           _UINT16_(0)                                          /* (USBHS_CTHHSRTN) the delay from the end of high speed resume signaling to enabling utm normal operating mode. Position */
#define USBHS_CTHHSRTN_CTHHSRTN_Msk           (_UINT16_(0xFFFF) << USBHS_CTHHSRTN_CTHHSRTN_Pos)    /* (USBHS_CTHHSRTN) the delay from the end of high speed resume signaling to enabling utm normal operating mode. Mask */
#define USBHS_CTHHSRTN_CTHHSRTN(value)        (USBHS_CTHHSRTN_CTHHSRTN_Msk & (_UINT16_(value) << USBHS_CTHHSRTN_CTHHSRTN_Pos)) /* Assigment of value for CTHHSRTN in the USBHS_CTHHSRTN register */
#define USBHS_CTHHSRTN_Msk                    _UINT16_(0xFFFF)                                     /* (USBHS_CTHHSRTN) Register Mask  */


/* -------- USBHS_CTHSBT : (USBHS Offset: 0x1348) (R/W 16) This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times. -------- */
#define USBHS_CTHSBT_RESETVALUE               _UINT16_(0x00)                                       /*  (USBHS_CTHSBT) This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times.  Reset Value */

#define USBHS_CTHSBT_HSTMEOUTADD_Pos          _UINT16_(0)                                          /* (USBHS_CTHSBT) this register represents the value to be added to the mimumum high speed timeout period of 736 bit times Position */
#define USBHS_CTHSBT_HSTMEOUTADD_Msk          (_UINT16_(0xF) << USBHS_CTHSBT_HSTMEOUTADD_Pos)      /* (USBHS_CTHSBT) this register represents the value to be added to the mimumum high speed timeout period of 736 bit times Mask */
#define USBHS_CTHSBT_HSTMEOUTADD(value)       (USBHS_CTHSBT_HSTMEOUTADD_Msk & (_UINT16_(value) << USBHS_CTHSBT_HSTMEOUTADD_Pos)) /* Assigment of value for HSTMEOUTADD in the USBHS_CTHSBT register */
#define USBHS_CTHSBT_Msk                      _UINT16_(0x000F)                                     /* (USBHS_CTHSBT) Register Mask  */


/* -------- USBHS_CTRLA : (USBHS Offset: 0x00) (R/W 32) USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected) -------- */
#define USBHS_CTRLA_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_CTRLA) USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected)  Reset Value */

