Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_CTRLA_SWRST_Pos                 _UINT32_(0)                                          /* (USBHS_CTRLA) USBHS Software Reset Position */
#define USBHS_CTRLA_SWRST_Msk                 (_UINT32_(0x1) << USBHS_CTRLA_SWRST_Pos)             /* (USBHS_CTRLA) USBHS Software Reset Mask */
#define USBHS_CTRLA_SWRST(value)              (USBHS_CTRLA_SWRST_Msk & (_UINT32_(value) << USBHS_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the USBHS_CTRLA register */
#define USBHS_CTRLA_ENABLE_Pos                _UINT32_(1)                                          /* (USBHS_CTRLA) USBHS Enable Position */
#define USBHS_CTRLA_ENABLE_Msk                (_UINT32_(0x1) << USBHS_CTRLA_ENABLE_Pos)            /* (USBHS_CTRLA) USBHS Enable Mask */
#define USBHS_CTRLA_ENABLE(value)             (USBHS_CTRLA_ENABLE_Msk & (_UINT32_(value) << USBHS_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the USBHS_CTRLA register */
#define USBHS_CTRLA_IDVAL_Pos                 _UINT32_(8)                                          /* (USBHS_CTRLA) Override Valud of ID Position */
#define USBHS_CTRLA_IDVAL_Msk                 (_UINT32_(0x1) << USBHS_CTRLA_IDVAL_Pos)             /* (USBHS_CTRLA) Override Valud of ID Mask */
#define USBHS_CTRLA_IDVAL(value)              (USBHS_CTRLA_IDVAL_Msk & (_UINT32_(value) << USBHS_CTRLA_IDVAL_Pos)) /* Assigment of value for IDVAL in the USBHS_CTRLA register */
#define USBHS_CTRLA_IDOVEN_Pos                _UINT32_(9)                                          /* (USBHS_CTRLA) ID Source Select Position */
#define USBHS_CTRLA_IDOVEN_Msk                (_UINT32_(0x1) << USBHS_CTRLA_IDOVEN_Pos)            /* (USBHS_CTRLA) ID Source Select Mask */
#define USBHS_CTRLA_IDOVEN(value)             (USBHS_CTRLA_IDOVEN_Msk & (_UINT32_(value) << USBHS_CTRLA_IDOVEN_Pos)) /* Assigment of value for IDOVEN in the USBHS_CTRLA register */
#define USBHS_CTRLA_REFCLKSEL_Pos             _UINT32_(10)                                         /* (USBHS_CTRLA) Select USB PLL Reference Clock  Speed Position */
#define USBHS_CTRLA_REFCLKSEL_Msk             (_UINT32_(0x1) << USBHS_CTRLA_REFCLKSEL_Pos)         /* (USBHS_CTRLA) Select USB PLL Reference Clock  Speed Mask */
#define USBHS_CTRLA_REFCLKSEL(value)          (USBHS_CTRLA_REFCLKSEL_Msk & (_UINT32_(value) << USBHS_CTRLA_REFCLKSEL_Pos)) /* Assigment of value for REFCLKSEL in the USBHS_CTRLA register */
#define USBHS_CTRLA_Msk                       _UINT32_(0x00000703)                                 /* (USBHS_CTRLA) Register Mask  */


/* -------- USBHS_CTRLB : (USBHS Offset: 0x04) (R/W 32) USBHS Control Register B -------- */
#define USBHS_CTRLB_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_CTRLB) USBHS Control Register B  Reset Value */

#define USBHS_CTRLB_BLANK_Pos                 _UINT32_(0)                                          /* (USBHS_CTRLB) Blank the wakeup monitoring for a specific real time Position */
#define USBHS_CTRLB_BLANK_Msk                 (_UINT32_(0xFFFFF) << USBHS_CTRLB_BLANK_Pos)         /* (USBHS_CTRLB) Blank the wakeup monitoring for a specific real time Mask */
#define USBHS_CTRLB_BLANK(value)              (USBHS_CTRLB_BLANK_Msk & (_UINT32_(value) << USBHS_CTRLB_BLANK_Pos)) /* Assigment of value for BLANK in the USBHS_CTRLB register */
#define   USBHS_CTRLB_BLANK_BLANK0_Val        _UINT32_(0x0)                                        /* (USBHS_CTRLB) No blank delay  */
#define   USBHS_CTRLB_BLANK_BLANKMAX_Val      _UINT32_(0xFFFFF)                                    /* (USBHS_CTRLB) Maximum blank delay  */
#define USBHS_CTRLB_BLANK_BLANK0              (USBHS_CTRLB_BLANK_BLANK0_Val << USBHS_CTRLB_BLANK_Pos) /* (USBHS_CTRLB) No blank delay Position  */
#define USBHS_CTRLB_BLANK_BLANKMAX            (USBHS_CTRLB_BLANK_BLANKMAX_Val << USBHS_CTRLB_BLANK_Pos) /* (USBHS_CTRLB) Maximum blank delay Position  */
#define USBHS_CTRLB_Msk                       _UINT32_(0x000FFFFF)                                 /* (USBHS_CTRLB) Register Mask  */


/* -------- USBHS_CTRLC : (USBHS Offset: 0x08) (R/W 32) USBHS Control Register C -------- */
#define USBHS_CTRLC_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_CTRLC) USBHS Control Register C  Reset Value */

#define USBHS_CTRLC_T1MSEN_Pos                _UINT32_(4)                                          /* (USBHS_CTRLC) REFCLK and SUSPENDM override Position */
#define USBHS_CTRLC_T1MSEN_Msk                (_UINT32_(0x1) << USBHS_CTRLC_T1MSEN_Pos)            /* (USBHS_CTRLC) REFCLK and SUSPENDM override Mask */
#define USBHS_CTRLC_T1MSEN(value)             (USBHS_CTRLC_T1MSEN_Msk & (_UINT32_(value) << USBHS_CTRLC_T1MSEN_Pos)) /* Assigment of value for T1MSEN in the USBHS_CTRLC register */
#define USBHS_CTRLC_Msk                       _UINT32_(0x00000010)                                 /* (USBHS_CTRLC) Register Mask  */


/* -------- USBHS_CTUCH : (USBHS Offset: 0x1344) (R/W 16) Chirp Timeout. Number Of XCLK Cycles Before The Timeout -------- */
#define USBHS_CTUCH_RESETVALUE                _UINT16_(0x4074)                                     /*  (USBHS_CTUCH) Chirp Timeout. Number Of XCLK Cycles Before The Timeout  Reset Value */

#define USBHS_CTUCH_CTUCH_Pos                 _UINT16_(0)                                          /* (USBHS_CTUCH) this number when multiplied by 4 represents the number of xclk cycles before the timeout occurs Position */
#define USBHS_CTUCH_CTUCH_Msk                 (_UINT16_(0xFFFF) << USBHS_CTUCH_CTUCH_Pos)          /* (USBHS_CTUCH) this number when multiplied by 4 represents the number of xclk cycles before the timeout occurs Mask */
#define USBHS_CTUCH_CTUCH(value)              (USBHS_CTUCH_CTUCH_Msk & (_UINT16_(value) << USBHS_CTUCH_CTUCH_Pos)) /* Assigment of value for CTUCH in the USBHS_CTUCH register */
#define USBHS_CTUCH_Msk                       _UINT16_(0xFFFF)                                     /* (USBHS_CTUCH) Register Mask  */


/* -------- USBHS_DEVCTL : (USBHS Offset: 0x1060) (R/W 8) Selects Whether The Core Is Operating In Peripheral Or Host Mode -------- */
#define USBHS_DEVCTL_RESETVALUE               _UINT8_(0x80)                                        /*  (USBHS_DEVCTL) Selects Whether The Core Is Operating In Peripheral Or Host Mode  Reset Value */

#define USBHS_DEVCTL_SESSION_Pos              _UINT8_(0)                                           /* (USBHS_DEVCTL) when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends Position */
#define USBHS_DEVCTL_SESSION_Msk              (_UINT8_(0x1) << USBHS_DEVCTL_SESSION_Pos)           /* (USBHS_DEVCTL) when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends Mask */
#define USBHS_DEVCTL_SESSION(value)           (USBHS_DEVCTL_SESSION_Msk & (_UINT8_(value) << USBHS_DEVCTL_SESSION_Pos)) /* Assigment of value for SESSION in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_HOSTREQ_Pos              _UINT8_(1)                                           /* (USBHS_DEVCTL) when set, the USBCORE will initiate the host negotiation when suspend mode is entered. Position */
#define USBHS_DEVCTL_HOSTREQ_Msk              (_UINT8_(0x1) << USBHS_DEVCTL_HOSTREQ_Pos)           /* (USBHS_DEVCTL) when set, the USBCORE will initiate the host negotiation when suspend mode is entered. Mask */
#define USBHS_DEVCTL_HOSTREQ(value)           (USBHS_DEVCTL_HOSTREQ_Msk & (_UINT8_(value) << USBHS_DEVCTL_HOSTREQ_Pos)) /* Assigment of value for HOSTREQ in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_HOSTMODE_Pos             _UINT8_(2)                                           /* (USBHS_DEVCTL) this read-only bit is set when the USBCORE is acting as a host Position */
#define USBHS_DEVCTL_HOSTMODE_Msk             (_UINT8_(0x1) << USBHS_DEVCTL_HOSTMODE_Pos)          /* (USBHS_DEVCTL) this read-only bit is set when the USBCORE is acting as a host Mask */
#define USBHS_DEVCTL_HOSTMODE(value)          (USBHS_DEVCTL_HOSTMODE_Msk & (_UINT8_(value) << USBHS_DEVCTL_HOSTMODE_Pos)) /* Assigment of value for HOSTMODE in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_VBUS_Pos                 _UINT8_(3)                                           /* (USBHS_DEVCTL) encoded value for the VBus level Position */
#define USBHS_DEVCTL_VBUS_Msk                 (_UINT8_(0x3) << USBHS_DEVCTL_VBUS_Pos)              /* (USBHS_DEVCTL) encoded value for the VBus level Mask */
#define USBHS_DEVCTL_VBUS(value)              (USBHS_DEVCTL_VBUS_Msk & (_UINT8_(value) << USBHS_DEVCTL_VBUS_Pos)) /* Assigment of value for VBUS in the USBHS_DEVCTL register */
#define   USBHS_DEVCTL_VBUS_BSESSEND_Val      _UINT8_(0x0)                                         /* (USBHS_DEVCTL) Below SessionEnd  */
#define   USBHS_DEVCTL_VBUS_ASESSEND_Val      _UINT8_(0x1)                                         /* (USBHS_DEVCTL) Above SessionEnd, below AValid  */
#define   USBHS_DEVCTL_VBUS_AAVALID_Val       _UINT8_(0x2)                                         /* (USBHS_DEVCTL) Above AValid, below VBus Valid  */
#define   USBHS_DEVCTL_VBUS_AVBUSVALID_Val    _UINT8_(0x3)                                         /* (USBHS_DEVCTL) Above VBusValid  */
#define USBHS_DEVCTL_VBUS_BSESSEND            (USBHS_DEVCTL_VBUS_BSESSEND_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Below SessionEnd Position  */
#define USBHS_DEVCTL_VBUS_ASESSEND            (USBHS_DEVCTL_VBUS_ASESSEND_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Above SessionEnd, below AValid Position  */
#define USBHS_DEVCTL_VBUS_AAVALID             (USBHS_DEVCTL_VBUS_AAVALID_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Above AValid, below VBus Valid Position  */
#define USBHS_DEVCTL_VBUS_AVBUSVALID          (USBHS_DEVCTL_VBUS_AVBUSVALID_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Above VBusValid Position  */
#define USBHS_DEVCTL_LSDEV_Pos                _UINT8_(5)                                           /* (USBHS_DEVCTL) host mode only: this bit is set when a low speed device has been detected being connected to the port Position */
#define USBHS_DEVCTL_LSDEV_Msk                (_UINT8_(0x1) << USBHS_DEVCTL_LSDEV_Pos)             /* (USBHS_DEVCTL) host mode only: this bit is set when a low speed device has been detected being connected to the port Mask */
#define USBHS_DEVCTL_LSDEV(value)             (USBHS_DEVCTL_LSDEV_Msk & (_UINT8_(value) << USBHS_DEVCTL_LSDEV_Pos)) /* Assigment of value for LSDEV in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_FSDEV_Pos                _UINT8_(6)                                           /* (USBHS_DEVCTL) host mode only: this bit is set when a full or high speed device has been detected being connected to the port Position */
#define USBHS_DEVCTL_FSDEV_Msk                (_UINT8_(0x1) << USBHS_DEVCTL_FSDEV_Pos)             /* (USBHS_DEVCTL) host mode only: this bit is set when a full or high speed device has been detected being connected to the port Mask */
#define USBHS_DEVCTL_FSDEV(value)             (USBHS_DEVCTL_FSDEV_Msk & (_UINT8_(value) << USBHS_DEVCTL_FSDEV_Pos)) /* Assigment of value for FSDEV in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_BDEVICE_Pos              _UINT8_(7)                                           /* (USBHS_DEVCTL) indicates whether the core is operating as a 'A' device or 'B' device Position */
#define USBHS_DEVCTL_BDEVICE_Msk              (_UINT8_(0x1) << USBHS_DEVCTL_BDEVICE_Pos)           /* (USBHS_DEVCTL) indicates whether the core is operating as a 'A' device or 'B' device Mask */
#define USBHS_DEVCTL_BDEVICE(value)           (USBHS_DEVCTL_BDEVICE_Msk & (_UINT8_(value) << USBHS_DEVCTL_BDEVICE_Pos)) /* Assigment of value for BDEVICE in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_Msk                      _UINT8_(0xFF)                                        /* (USBHS_DEVCTL) Register Mask  */


/* -------- USBHS_DMAINTR : (USBHS Offset: 0x1200) (R/W 32) DMA Interrupt Status for Each Channel -------- */
#define USBHS_DMAINTR_RESETVALUE              _UINT32_(0x00)                                       /*  (USBHS_DMAINTR) DMA Interrupt Status for Each Channel  Reset Value */

#define USBHS_DMAINTR_DMAINTR_Pos             _UINT32_(0)                                          /* (USBHS_DMAINTR) DMA Interrupt for each channel Position */
#define USBHS_DMAINTR_DMAINTR_Msk             (_UINT32_(0xFF) << USBHS_DMAINTR_DMAINTR_Pos)        /* (USBHS_DMAINTR) DMA Interrupt for each channel Mask */
#define USBHS_DMAINTR_DMAINTR(value)          (USBHS_DMAINTR_DMAINTR_Msk & (_UINT32_(value) << USBHS_DMAINTR_DMAINTR_Pos)) /* Assigment of value for DMAINTR in the USBHS_DMAINTR register */
#define USBHS_DMAINTR_Msk                     _UINT32_(0x000000FF)                                 /* (USBHS_DMAINTR) Register Mask  */


/* -------- USBHS_EPINFO : (USBHS Offset: 0x1078) ( R/ 8) Allows Read-Back Of The Number Of TX And RX Endpoints -------- */
#define USBHS_EPINFO_RESETVALUE               _UINT8_(0xFF)                                        /*  (USBHS_EPINFO) Allows Read-Back Of The Number Of TX And RX Endpoints  Reset Value */

#define USBHS_EPINFO_TXENDPOINTS_Pos          _UINT8_(0)                                           /* (USBHS_EPINFO) number of tx endpoints Position */
#define USBHS_EPINFO_TXENDPOINTS_Msk          (_UINT8_(0xF) << USBHS_EPINFO_TXENDPOINTS_Pos)       /* (USBHS_EPINFO) number of tx endpoints Mask */
#define USBHS_EPINFO_TXENDPOINTS(value)       (USBHS_EPINFO_TXENDPOINTS_Msk & (_UINT8_(value) << USBHS_EPINFO_TXENDPOINTS_Pos)) /* Assigment of value for TXENDPOINTS in the USBHS_EPINFO register */
#define USBHS_EPINFO_RXENDPOINTS_Pos          _UINT8_(4)                                           /* (USBHS_EPINFO) number of rx endpoints Position */
#define USBHS_EPINFO_RXENDPOINTS_Msk          (_UINT8_(0xF) << USBHS_EPINFO_RXENDPOINTS_Pos)       /* (USBHS_EPINFO) number of rx endpoints Mask */
#define USBHS_EPINFO_RXENDPOINTS(value)       (USBHS_EPINFO_RXENDPOINTS_Msk & (_UINT8_(value) << USBHS_EPINFO_RXENDPOINTS_Pos)) /* Assigment of value for RXENDPOINTS in the USBHS_EPINFO register */
#define USBHS_EPINFO_Msk                      _UINT8_(0xFF)                                        /* (USBHS_EPINFO) Register Mask  */


