Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_FADDR : (USBHS Offset: 0x1000) (R/W 8) Function Address Register -------- */
#define USBHS_FADDR_RESETVALUE                _UINT8_(0x00)                                        /*  (USBHS_FADDR) Function Address Register  Reset Value */

#define USBHS_FADDR_FUNCADDR_Pos              _UINT8_(0)                                           /* (USBHS_FADDR) Function address Position */
#define USBHS_FADDR_FUNCADDR_Msk              (_UINT8_(0x7F) << USBHS_FADDR_FUNCADDR_Pos)          /* (USBHS_FADDR) Function address Mask */
#define USBHS_FADDR_FUNCADDR(value)           (USBHS_FADDR_FUNCADDR_Msk & (_UINT8_(value) << USBHS_FADDR_FUNCADDR_Pos)) /* Assigment of value for FUNCADDR in the USBHS_FADDR register */
#define USBHS_FADDR_Msk                       _UINT8_(0x7F)                                        /* (USBHS_FADDR) Register Mask  */


/* -------- USBHS_ENDPOINTX_FIFOSIZE : (USBHS Offset: 0x101F) ( R/ 8) ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15 -------- */
#define USBHS_ENDPOINTX_FIFOSIZE_RESETVALUE   _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_FIFOSIZE) ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15  Reset Value */

#define USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_FIFOSIZE) Tx FIFO Size Position */
#define USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Pos) /* (USBHS_ENDPOINTX_FIFOSIZE) Tx FIFO Size Mask */
#define USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE(value) (USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Pos)) /* Assigment of value for TXFIFOSIZE in the USBHS_ENDPOINTX_FIFOSIZE register */
#define USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_FIFOSIZE) Rx FIFO Size Position */
#define USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Pos) /* (USBHS_ENDPOINTX_FIFOSIZE) Rx FIFO Size Mask */
#define USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE(value) (USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Pos)) /* Assigment of value for RXFIFOSIZE in the USBHS_ENDPOINTX_FIFOSIZE register */
#define USBHS_ENDPOINTX_FIFOSIZE_Msk          _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_FIFOSIZE) Register Mask  */


/* -------- USBHS_FIFOX : (USBHS Offset: 0x1020) (R/W 32) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint -------- */
#define USBHS_FIFOX_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_FIFOX) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint  Reset Value */

#define USBHS_FIFOX_FIFOADDR_Pos              _UINT32_(0)                                          /* (USBHS_FIFOX) Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint Position */
#define USBHS_FIFOX_FIFOADDR_Msk              (_UINT32_(0xFFFFFFFF) << USBHS_FIFOX_FIFOADDR_Pos)   /* (USBHS_FIFOX) Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint Mask */
#define USBHS_FIFOX_FIFOADDR(value)           (USBHS_FIFOX_FIFOADDR_Msk & (_UINT32_(value) << USBHS_FIFOX_FIFOADDR_Pos)) /* Assigment of value for FIFOADDR in the USBHS_FIFOX register */
#define USBHS_FIFOX_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (USBHS_FIFOX) Register Mask  */


/* -------- USBHS_FRAME : (USBHS Offset: 0x100C) ( R/ 16) Holds The Last Received Frame Number -------- */
#define USBHS_FRAME_RESETVALUE                _UINT16_(0x00)                                       /*  (USBHS_FRAME) Holds The Last Received Frame Number  Reset Value */

#define USBHS_FRAME_FRMNUM_Pos                _UINT16_(0)                                          /* (USBHS_FRAME) Frame Number Position */
#define USBHS_FRAME_FRMNUM_Msk                (_UINT16_(0x7FF) << USBHS_FRAME_FRMNUM_Pos)          /* (USBHS_FRAME) Frame Number Mask */
#define USBHS_FRAME_FRMNUM(value)             (USBHS_FRAME_FRMNUM_Msk & (_UINT16_(value) << USBHS_FRAME_FRMNUM_Pos)) /* Assigment of value for FRMNUM in the USBHS_FRAME register */
#define USBHS_FRAME_Msk                       _UINT16_(0x07FF)                                     /* (USBHS_FRAME) Register Mask  */


/* -------- USBHS_FSEOF1 : (USBHS Offset: 0x107D) (R/W 8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions -------- */
#define USBHS_FSEOF1_RESETVALUE               _UINT8_(0x77)                                        /*  (USBHS_FSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions  Reset Value */

#define USBHS_FSEOF1_FSEOF1_Pos               _UINT8_(0)                                           /* (USBHS_FSEOF1) sets for full-speed transactions the time before eof to stop beginning new transactions, in units of 533.3ns. (the default setting corresponds to 63.46us.) Position */
#define USBHS_FSEOF1_FSEOF1_Msk               (_UINT8_(0xFF) << USBHS_FSEOF1_FSEOF1_Pos)           /* (USBHS_FSEOF1) sets for full-speed transactions the time before eof to stop beginning new transactions, in units of 533.3ns. (the default setting corresponds to 63.46us.) Mask */
#define USBHS_FSEOF1_FSEOF1(value)            (USBHS_FSEOF1_FSEOF1_Msk & (_UINT8_(value) << USBHS_FSEOF1_FSEOF1_Pos)) /* Assigment of value for FSEOF1 in the USBHS_FSEOF1 register */
#define USBHS_FSEOF1_Msk                      _UINT8_(0xFF)                                        /* (USBHS_FSEOF1) Register Mask  */


/* -------- USBHS_HSEOF1 : (USBHS Offset: 0x107C) (R/W 8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions -------- */
#define USBHS_HSEOF1_RESETVALUE               _UINT8_(0x80)                                        /*  (USBHS_HSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions  Reset Value */

