Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_HSEOF1_HSEOF1_Pos               _UINT8_(0)                                           /* (USBHS_HSEOF1) sets for high-speed transactions the time before eof to stop beginning new transactions, in units of 133.3ns. (the default setting corresponds to 17.07us.) Position */
#define USBHS_HSEOF1_HSEOF1_Msk               (_UINT8_(0xFF) << USBHS_HSEOF1_HSEOF1_Pos)           /* (USBHS_HSEOF1) sets for high-speed transactions the time before eof to stop beginning new transactions, in units of 133.3ns. (the default setting corresponds to 17.07us.) Mask */
#define USBHS_HSEOF1_HSEOF1(value)            (USBHS_HSEOF1_HSEOF1_Msk & (_UINT8_(value) << USBHS_HSEOF1_HSEOF1_Pos)) /* Assigment of value for HSEOF1 in the USBHS_HSEOF1 register */
#define USBHS_HSEOF1_Msk                      _UINT8_(0xFF)                                        /* (USBHS_HSEOF1) Register Mask  */


/* -------- USBHS_INDEX : (USBHS Offset: 0x100E) (R/W 8) Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed -------- */
#define USBHS_INDEX_RESETVALUE                _UINT8_(0x00)                                        /*  (USBHS_INDEX) Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed  Reset Value */

#define USBHS_INDEX_SELEP_Pos                 _UINT8_(0)                                           /* (USBHS_INDEX) The Selected Endpoint Position */
#define USBHS_INDEX_SELEP_Msk                 (_UINT8_(0xF) << USBHS_INDEX_SELEP_Pos)              /* (USBHS_INDEX) The Selected Endpoint Mask */
#define USBHS_INDEX_SELEP(value)              (USBHS_INDEX_SELEP_Msk & (_UINT8_(value) << USBHS_INDEX_SELEP_Pos)) /* Assigment of value for SELEP in the USBHS_INDEX register */
#define   USBHS_INDEX_SELEP_EP0_Val           _UINT8_(0x0)                                         /* (USBHS_INDEX) Endpoint 0 Select  */
#define   USBHS_INDEX_SELEP_EP1_Val           _UINT8_(0x1)                                         /* (USBHS_INDEX) Endpoint 1 Select  */
#define   USBHS_INDEX_SELEP_EP2_Val           _UINT8_(0x2)                                         /* (USBHS_INDEX) Endpoint 2 Select  */
#define   USBHS_INDEX_SELEP_EP3_Val           _UINT8_(0x3)                                         /* (USBHS_INDEX) Endpoint 3 Select  */
#define   USBHS_INDEX_SELEP_EP4_Val           _UINT8_(0x4)                                         /* (USBHS_INDEX) Endpoint 4 Select  */
#define   USBHS_INDEX_SELEP_EP5_Val           _UINT8_(0x5)                                         /* (USBHS_INDEX) Endpoint 5 Select  */
#define   USBHS_INDEX_SELEP_EP6_Val           _UINT8_(0x6)                                         /* (USBHS_INDEX) Endpoint 6 Select  */
#define   USBHS_INDEX_SELEP_EP7_Val           _UINT8_(0x7)                                         /* (USBHS_INDEX) Endpoint 7 Select  */
#define   USBHS_INDEX_SELEP_EP8_Val           _UINT8_(0x8)                                         /* (USBHS_INDEX) Endpoint 8 Select  */
#define USBHS_INDEX_SELEP_EP0                 (USBHS_INDEX_SELEP_EP0_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 0 Select Position  */
#define USBHS_INDEX_SELEP_EP1                 (USBHS_INDEX_SELEP_EP1_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 1 Select Position  */
#define USBHS_INDEX_SELEP_EP2                 (USBHS_INDEX_SELEP_EP2_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 2 Select Position  */
#define USBHS_INDEX_SELEP_EP3                 (USBHS_INDEX_SELEP_EP3_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 3 Select Position  */
#define USBHS_INDEX_SELEP_EP4                 (USBHS_INDEX_SELEP_EP4_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 4 Select Position  */
#define USBHS_INDEX_SELEP_EP5                 (USBHS_INDEX_SELEP_EP5_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 5 Select Position  */
#define USBHS_INDEX_SELEP_EP6                 (USBHS_INDEX_SELEP_EP6_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 6 Select Position  */
#define USBHS_INDEX_SELEP_EP7                 (USBHS_INDEX_SELEP_EP7_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 7 Select Position  */
#define USBHS_INDEX_SELEP_EP8                 (USBHS_INDEX_SELEP_EP8_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 8 Select Position  */
#define USBHS_INDEX_Msk                       _UINT8_(0x0F)                                        /* (USBHS_INDEX) Register Mask  */


/* -------- USBHS_INTENCLR : (USBHS Offset: 0x0C) (R/W 32) USBHS Interrupt Enable Clear Register -------- */
#define USBHS_INTENCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_INTENCLR) USBHS Interrupt Enable Clear Register  Reset Value */

#define USBHS_INTENCLR_WAKEUP_Pos             _UINT32_(0)                                          /* (USBHS_INTENCLR) Clear USCORE Detaction Interrupt Enable Position */
#define USBHS_INTENCLR_WAKEUP_Msk             (_UINT32_(0x1) << USBHS_INTENCLR_WAKEUP_Pos)         /* (USBHS_INTENCLR) Clear USCORE Detaction Interrupt Enable Mask */
#define USBHS_INTENCLR_WAKEUP(value)          (USBHS_INTENCLR_WAKEUP_Msk & (_UINT32_(value) << USBHS_INTENCLR_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_RESUME_Pos             _UINT32_(1)                                          /* (USBHS_INTENCLR) Clear Resume Interrupt Enable Position */
#define USBHS_INTENCLR_RESUME_Msk             (_UINT32_(0x1) << USBHS_INTENCLR_RESUME_Pos)         /* (USBHS_INTENCLR) Clear Resume Interrupt Enable Mask */
#define USBHS_INTENCLR_RESUME(value)          (USBHS_INTENCLR_RESUME_Msk & (_UINT32_(value) << USBHS_INTENCLR_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_USB_Pos                _UINT32_(2)                                          /* (USBHS_INTENCLR) Clear USBCORE General Interrupt Enable Position */
#define USBHS_INTENCLR_USB_Msk                (_UINT32_(0x1) << USBHS_INTENCLR_USB_Pos)            /* (USBHS_INTENCLR) Clear USBCORE General Interrupt Enable Mask */
#define USBHS_INTENCLR_USB(value)             (USBHS_INTENCLR_USB_Msk & (_UINT32_(value) << USBHS_INTENCLR_USB_Pos)) /* Assigment of value for USB in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_DMA_Pos                _UINT32_(3)                                          /* (USBHS_INTENCLR) Clear DMA Interrupt Enable Position */
#define USBHS_INTENCLR_DMA_Msk                (_UINT32_(0x1) << USBHS_INTENCLR_DMA_Pos)            /* (USBHS_INTENCLR) Clear DMA Interrupt Enable Mask */
#define USBHS_INTENCLR_DMA(value)             (USBHS_INTENCLR_DMA_Msk & (_UINT32_(value) << USBHS_INTENCLR_DMA_Pos)) /* Assigment of value for DMA in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_T1MS_Pos               _UINT32_(4)                                          /* (USBHS_INTENCLR) Clear T1MS Interrupt Enable Position */
#define USBHS_INTENCLR_T1MS_Msk               (_UINT32_(0x1) << USBHS_INTENCLR_T1MS_Pos)           /* (USBHS_INTENCLR) Clear T1MS Interrupt Enable Mask */
#define USBHS_INTENCLR_T1MS(value)            (USBHS_INTENCLR_T1MS_Msk & (_UINT32_(value) << USBHS_INTENCLR_T1MS_Pos)) /* Assigment of value for T1MS in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_PHYRDY_Pos             _UINT32_(5)                                          /* (USBHS_INTENCLR) Clear PHYRDY Interrupt Enable Position */
#define USBHS_INTENCLR_PHYRDY_Msk             (_UINT32_(0x1) << USBHS_INTENCLR_PHYRDY_Pos)         /* (USBHS_INTENCLR) Clear PHYRDY Interrupt Enable Mask */
#define USBHS_INTENCLR_PHYRDY(value)          (USBHS_INTENCLR_PHYRDY_Msk & (_UINT32_(value) << USBHS_INTENCLR_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_Msk                    _UINT32_(0x0000003F)                                 /* (USBHS_INTENCLR) Register Mask  */


/* -------- USBHS_INTENSET : (USBHS Offset: 0x10) (R/W 32) USBHS Interrupt Enable Clear Register -------- */
#define USBHS_INTENSET_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_INTENSET) USBHS Interrupt Enable Clear Register  Reset Value */

#define USBHS_INTENSET_WAKEUP_Pos             _UINT32_(0)                                          /* (USBHS_INTENSET) USCORE Detaction Interrupt Enable Position */
#define USBHS_INTENSET_WAKEUP_Msk             (_UINT32_(0x1) << USBHS_INTENSET_WAKEUP_Pos)         /* (USBHS_INTENSET) USCORE Detaction Interrupt Enable Mask */
#define USBHS_INTENSET_WAKEUP(value)          (USBHS_INTENSET_WAKEUP_Msk & (_UINT32_(value) << USBHS_INTENSET_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_INTENSET register */
#define USBHS_INTENSET_RESUME_Pos             _UINT32_(1)                                          /* (USBHS_INTENSET) Resume Interrupt Enable Position */
#define USBHS_INTENSET_RESUME_Msk             (_UINT32_(0x1) << USBHS_INTENSET_RESUME_Pos)         /* (USBHS_INTENSET) Resume Interrupt Enable Mask */
#define USBHS_INTENSET_RESUME(value)          (USBHS_INTENSET_RESUME_Msk & (_UINT32_(value) << USBHS_INTENSET_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTENSET register */
#define USBHS_INTENSET_USB_Pos                _UINT32_(2)                                          /* (USBHS_INTENSET) USBCORE General Interrupt Enable Position */
#define USBHS_INTENSET_USB_Msk                (_UINT32_(0x1) << USBHS_INTENSET_USB_Pos)            /* (USBHS_INTENSET) USBCORE General Interrupt Enable Mask */
#define USBHS_INTENSET_USB(value)             (USBHS_INTENSET_USB_Msk & (_UINT32_(value) << USBHS_INTENSET_USB_Pos)) /* Assigment of value for USB in the USBHS_INTENSET register */
#define USBHS_INTENSET_DMA_Pos                _UINT32_(3)                                          /* (USBHS_INTENSET) DMA Interrupt Enable Position */
#define USBHS_INTENSET_DMA_Msk                (_UINT32_(0x1) << USBHS_INTENSET_DMA_Pos)            /* (USBHS_INTENSET) DMA Interrupt Enable Mask */
#define USBHS_INTENSET_DMA(value)             (USBHS_INTENSET_DMA_Msk & (_UINT32_(value) << USBHS_INTENSET_DMA_Pos)) /* Assigment of value for DMA in the USBHS_INTENSET register */
#define USBHS_INTENSET_T1MS_Pos               _UINT32_(4)                                          /* (USBHS_INTENSET) T1MS Interrupt Enable Position */
#define USBHS_INTENSET_T1MS_Msk               (_UINT32_(0x1) << USBHS_INTENSET_T1MS_Pos)           /* (USBHS_INTENSET) T1MS Interrupt Enable Mask */
#define USBHS_INTENSET_T1MS(value)            (USBHS_INTENSET_T1MS_Msk & (_UINT32_(value) << USBHS_INTENSET_T1MS_Pos)) /* Assigment of value for T1MS in the USBHS_INTENSET register */
#define USBHS_INTENSET_PHYRDY_Pos             _UINT32_(5)                                          /* (USBHS_INTENSET) PHYRDY Interrupt Enable Position */
#define USBHS_INTENSET_PHYRDY_Msk             (_UINT32_(0x1) << USBHS_INTENSET_PHYRDY_Pos)         /* (USBHS_INTENSET) PHYRDY Interrupt Enable Mask */
#define USBHS_INTENSET_PHYRDY(value)          (USBHS_INTENSET_PHYRDY_Msk & (_UINT32_(value) << USBHS_INTENSET_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_INTENSET register */
#define USBHS_INTENSET_Msk                    _UINT32_(0x0000003F)                                 /* (USBHS_INTENSET) Register Mask  */


