Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_INTFLAG : (USBHS Offset: 0x14) (R/W 32) USBHS Interrupt Flag Register -------- */
#define USBHS_INTFLAG_RESETVALUE              _UINT32_(0x00)                                       /*  (USBHS_INTFLAG) USBHS Interrupt Flag Register  Reset Value */

#define USBHS_INTFLAG_WAKEUP_Pos              _UINT32_(0)                                          /* (USBHS_INTFLAG) USB Activity Detection Interrupt Position */
#define USBHS_INTFLAG_WAKEUP_Msk              (_UINT32_(0x1) << USBHS_INTFLAG_WAKEUP_Pos)          /* (USBHS_INTFLAG) USB Activity Detection Interrupt Mask */
#define USBHS_INTFLAG_WAKEUP(value)           (USBHS_INTFLAG_WAKEUP_Msk & (_UINT32_(value) << USBHS_INTFLAG_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_RESUME_Pos              _UINT32_(1)                                          /* (USBHS_INTFLAG) Resume Interrupt Position */
#define USBHS_INTFLAG_RESUME_Msk              (_UINT32_(0x1) << USBHS_INTFLAG_RESUME_Pos)          /* (USBHS_INTFLAG) Resume Interrupt Mask */
#define USBHS_INTFLAG_RESUME(value)           (USBHS_INTFLAG_RESUME_Msk & (_UINT32_(value) << USBHS_INTFLAG_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_USB_Pos                 _UINT32_(2)                                          /* (USBHS_INTFLAG) USBCORE General Interrupt Position */
#define USBHS_INTFLAG_USB_Msk                 (_UINT32_(0x1) << USBHS_INTFLAG_USB_Pos)             /* (USBHS_INTFLAG) USBCORE General Interrupt Mask */
#define USBHS_INTFLAG_USB(value)              (USBHS_INTFLAG_USB_Msk & (_UINT32_(value) << USBHS_INTFLAG_USB_Pos)) /* Assigment of value for USB in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_DMA_Pos                 _UINT32_(3)                                          /* (USBHS_INTFLAG) DMA Interrupt Position */
#define USBHS_INTFLAG_DMA_Msk                 (_UINT32_(0x1) << USBHS_INTFLAG_DMA_Pos)             /* (USBHS_INTFLAG) DMA Interrupt Mask */
#define USBHS_INTFLAG_DMA(value)              (USBHS_INTFLAG_DMA_Msk & (_UINT32_(value) << USBHS_INTFLAG_DMA_Pos)) /* Assigment of value for DMA in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_T1MS_Pos                _UINT32_(4)                                          /* (USBHS_INTFLAG) Timer 1ms Tick Interrupt Position */
#define USBHS_INTFLAG_T1MS_Msk                (_UINT32_(0x1) << USBHS_INTFLAG_T1MS_Pos)            /* (USBHS_INTFLAG) Timer 1ms Tick Interrupt Mask */
#define USBHS_INTFLAG_T1MS(value)             (USBHS_INTFLAG_T1MS_Msk & (_UINT32_(value) << USBHS_INTFLAG_T1MS_Pos)) /* Assigment of value for T1MS in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_PHYRDY_Pos              _UINT32_(5)                                          /* (USBHS_INTFLAG) PHY Ready Interrupt Position */
#define USBHS_INTFLAG_PHYRDY_Msk              (_UINT32_(0x1) << USBHS_INTFLAG_PHYRDY_Pos)          /* (USBHS_INTFLAG) PHY Ready Interrupt Mask */
#define USBHS_INTFLAG_PHYRDY(value)           (USBHS_INTFLAG_PHYRDY_Msk & (_UINT32_(value) << USBHS_INTFLAG_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_Msk                     _UINT32_(0x0000003F)                                 /* (USBHS_INTFLAG) Register Mask  */


/* -------- USBHS_INTRRX : (USBHS Offset: 0x1004) ( R/ 16) Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15 -------- */
#define USBHS_INTRRX_RESETVALUE               _UINT16_(0x00)                                       /*  (USBHS_INTRRX) Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15  Reset Value */

#define USBHS_INTRRX_EP1RX_Pos                _UINT16_(1)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX1 Endpoint Position */
#define USBHS_INTRRX_EP1RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP1RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX1 Endpoint Mask */
#define USBHS_INTRRX_EP1RX(value)             (USBHS_INTRRX_EP1RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP1RX_Pos)) /* Assigment of value for EP1RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP2RX_Pos                _UINT16_(2)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX2 Endpoint Position */
#define USBHS_INTRRX_EP2RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP2RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX2 Endpoint Mask */
#define USBHS_INTRRX_EP2RX(value)             (USBHS_INTRRX_EP2RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP2RX_Pos)) /* Assigment of value for EP2RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP3RX_Pos                _UINT16_(3)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX3 Endpoint Position */
#define USBHS_INTRRX_EP3RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP3RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX3 Endpoint Mask */
#define USBHS_INTRRX_EP3RX(value)             (USBHS_INTRRX_EP3RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP3RX_Pos)) /* Assigment of value for EP3RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP4RX_Pos                _UINT16_(4)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX4 Endpoint Position */
#define USBHS_INTRRX_EP4RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP4RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX4 Endpoint Mask */
#define USBHS_INTRRX_EP4RX(value)             (USBHS_INTRRX_EP4RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP4RX_Pos)) /* Assigment of value for EP4RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP5RX_Pos                _UINT16_(5)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX5 Endpoint Position */
#define USBHS_INTRRX_EP5RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP5RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX5 Endpoint Mask */
#define USBHS_INTRRX_EP5RX(value)             (USBHS_INTRRX_EP5RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP5RX_Pos)) /* Assigment of value for EP5RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP6RX_Pos                _UINT16_(6)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX6 Endpoint Position */
#define USBHS_INTRRX_EP6RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP6RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX6 Endpoint Mask */
#define USBHS_INTRRX_EP6RX(value)             (USBHS_INTRRX_EP6RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP6RX_Pos)) /* Assigment of value for EP6RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP7RX_Pos                _UINT16_(7)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX7 Endpoint Position */
#define USBHS_INTRRX_EP7RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP7RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX7 Endpoint Mask */
#define USBHS_INTRRX_EP7RX(value)             (USBHS_INTRRX_EP7RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP7RX_Pos)) /* Assigment of value for EP7RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_Msk                      _UINT16_(0x00FE)                                     /* (USBHS_INTRRX) Register Mask  */


