Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_INTRRXE : (USBHS Offset: 0x1008) (R/W 16) Interrupt Enable Bits for INTRRX -------- */
#define USBHS_INTRRXE_RESETVALUE              _UINT16_(0xFFFE)                                     /*  (USBHS_INTRRXE) Interrupt Enable Bits for INTRRX  Reset Value */

#define USBHS_INTRRXE_EP1RXE_Pos              _UINT16_(1)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP1 Position */
#define USBHS_INTRRXE_EP1RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP1RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP1 Mask */
#define USBHS_INTRRXE_EP1RXE(value)           (USBHS_INTRRXE_EP1RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP1RXE_Pos)) /* Assigment of value for EP1RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP2RXE_Pos              _UINT16_(2)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP2 Position */
#define USBHS_INTRRXE_EP2RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP2RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP2 Mask */
#define USBHS_INTRRXE_EP2RXE(value)           (USBHS_INTRRXE_EP2RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP2RXE_Pos)) /* Assigment of value for EP2RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP3RXE_Pos              _UINT16_(3)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP3 Position */
#define USBHS_INTRRXE_EP3RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP3RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP3 Mask */
#define USBHS_INTRRXE_EP3RXE(value)           (USBHS_INTRRXE_EP3RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP3RXE_Pos)) /* Assigment of value for EP3RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP4RXE_Pos              _UINT16_(4)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP4 Position */
#define USBHS_INTRRXE_EP4RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP4RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP4 Mask */
#define USBHS_INTRRXE_EP4RXE(value)           (USBHS_INTRRXE_EP4RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP4RXE_Pos)) /* Assigment of value for EP4RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP5RXE_Pos              _UINT16_(5)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP5 Position */
#define USBHS_INTRRXE_EP5RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP5RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP5 Mask */
#define USBHS_INTRRXE_EP5RXE(value)           (USBHS_INTRRXE_EP5RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP5RXE_Pos)) /* Assigment of value for EP5RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP6RXE_Pos              _UINT16_(6)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP6 Position */
#define USBHS_INTRRXE_EP6RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP6RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP6 Mask */
#define USBHS_INTRRXE_EP6RXE(value)           (USBHS_INTRRXE_EP6RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP6RXE_Pos)) /* Assigment of value for EP6RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP7RXE_Pos              _UINT16_(7)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP7 Position */
#define USBHS_INTRRXE_EP7RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP7RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP7 Mask */
#define USBHS_INTRRXE_EP7RXE(value)           (USBHS_INTRRXE_EP7RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP7RXE_Pos)) /* Assigment of value for EP7RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_Msk                     _UINT16_(0x00FE)                                     /* (USBHS_INTRRXE) Register Mask  */


/* -------- USBHS_INTRTX : (USBHS Offset: 0x1002) ( R/ 16) Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15 -------- */
#define USBHS_INTRTX_RESETVALUE               _UINT16_(0x00)                                       /*  (USBHS_INTRTX) Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15  Reset Value */

#define USBHS_INTRTX_EP0TX_Pos                _UINT16_(0)                                          /* (USBHS_INTRTX) Interrupts Active For TX0 Endpoint Position */
#define USBHS_INTRTX_EP0TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP0TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX0 Endpoint Mask */
#define USBHS_INTRTX_EP0TX(value)             (USBHS_INTRTX_EP0TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP0TX_Pos)) /* Assigment of value for EP0TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP1TX_Pos                _UINT16_(1)                                          /* (USBHS_INTRTX) Interrupts Active For TX1 Endpoint Position */
#define USBHS_INTRTX_EP1TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP1TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX1 Endpoint Mask */
#define USBHS_INTRTX_EP1TX(value)             (USBHS_INTRTX_EP1TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP1TX_Pos)) /* Assigment of value for EP1TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP2TX_Pos                _UINT16_(2)                                          /* (USBHS_INTRTX) Interrupts Active For TX2 Endpoint Position */
#define USBHS_INTRTX_EP2TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP2TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX2 Endpoint Mask */
#define USBHS_INTRTX_EP2TX(value)             (USBHS_INTRTX_EP2TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP2TX_Pos)) /* Assigment of value for EP2TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP3TX_Pos                _UINT16_(3)                                          /* (USBHS_INTRTX) Interrupts Active For TX3 Endpoint Position */
#define USBHS_INTRTX_EP3TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP3TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX3 Endpoint Mask */
#define USBHS_INTRTX_EP3TX(value)             (USBHS_INTRTX_EP3TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP3TX_Pos)) /* Assigment of value for EP3TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP4TX_Pos                _UINT16_(4)                                          /* (USBHS_INTRTX) Interrupts Active For TX4 Endpoint Position */
#define USBHS_INTRTX_EP4TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP4TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX4 Endpoint Mask */
#define USBHS_INTRTX_EP4TX(value)             (USBHS_INTRTX_EP4TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP4TX_Pos)) /* Assigment of value for EP4TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP5TX_Pos                _UINT16_(5)                                          /* (USBHS_INTRTX) Interrupts Active For TX5 Endpoint Position */
#define USBHS_INTRTX_EP5TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP5TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX5 Endpoint Mask */
#define USBHS_INTRTX_EP5TX(value)             (USBHS_INTRTX_EP5TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP5TX_Pos)) /* Assigment of value for EP5TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP6TX_Pos                _UINT16_(6)                                          /* (USBHS_INTRTX) Interrupts Active For TX6 Endpoint Position */
#define USBHS_INTRTX_EP6TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP6TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX6 Endpoint Mask */
#define USBHS_INTRTX_EP6TX(value)             (USBHS_INTRTX_EP6TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP6TX_Pos)) /* Assigment of value for EP6TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP7TX_Pos                _UINT16_(7)                                          /* (USBHS_INTRTX) Interrupts Active For TX7 Endpoint Position */
#define USBHS_INTRTX_EP7TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP7TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX7 Endpoint Mask */
#define USBHS_INTRTX_EP7TX(value)             (USBHS_INTRTX_EP7TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP7TX_Pos)) /* Assigment of value for EP7TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_Msk                      _UINT16_(0x00FF)                                     /* (USBHS_INTRTX) Register Mask  */


/* -------- USBHS_INTRTXE : (USBHS Offset: 0x1006) (R/W 16) Interrupt Enable Bits for INTRTX -------- */
#define USBHS_INTRTXE_RESETVALUE              _UINT16_(0xFFFF)                                     /*  (USBHS_INTRTXE) Interrupt Enable Bits for INTRTX  Reset Value */

#define USBHS_INTRTXE_EP0TXEN_Pos             _UINT16_(0)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP0 Position */
#define USBHS_INTRTXE_EP0TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP0TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP0 Mask */
#define USBHS_INTRTXE_EP0TXEN(value)          (USBHS_INTRTXE_EP0TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP0TXEN_Pos)) /* Assigment of value for EP0TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP1TXEN_Pos             _UINT16_(1)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP1 Position */
#define USBHS_INTRTXE_EP1TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP1TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP1 Mask */
#define USBHS_INTRTXE_EP1TXEN(value)          (USBHS_INTRTXE_EP1TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP1TXEN_Pos)) /* Assigment of value for EP1TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP2TXEN_Pos             _UINT16_(2)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP2 Position */
#define USBHS_INTRTXE_EP2TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP2TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP2 Mask */
#define USBHS_INTRTXE_EP2TXEN(value)          (USBHS_INTRTXE_EP2TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP2TXEN_Pos)) /* Assigment of value for EP2TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP3TXEN_Pos             _UINT16_(3)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP3 Position */
#define USBHS_INTRTXE_EP3TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP3TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP3 Mask */
#define USBHS_INTRTXE_EP3TXEN(value)          (USBHS_INTRTXE_EP3TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP3TXEN_Pos)) /* Assigment of value for EP3TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP4TXEN_Pos             _UINT16_(4)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP4 Position */
#define USBHS_INTRTXE_EP4TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP4TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP4 Mask */
#define USBHS_INTRTXE_EP4TXEN(value)          (USBHS_INTRTXE_EP4TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP4TXEN_Pos)) /* Assigment of value for EP4TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP5TXEN_Pos             _UINT16_(5)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP5 Position */
#define USBHS_INTRTXE_EP5TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP5TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP5 Mask */
#define USBHS_INTRTXE_EP5TXEN(value)          (USBHS_INTRTXE_EP5TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP5TXEN_Pos)) /* Assigment of value for EP5TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP6TXEN_Pos             _UINT16_(6)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP6 Position */
#define USBHS_INTRTXE_EP6TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP6TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP6 Mask */
#define USBHS_INTRTXE_EP6TXEN(value)          (USBHS_INTRTXE_EP6TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP6TXEN_Pos)) /* Assigment of value for EP6TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP7TXEN_Pos             _UINT16_(7)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP7 Position */
#define USBHS_INTRTXE_EP7TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP7TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP7 Mask */
#define USBHS_INTRTXE_EP7TXEN(value)          (USBHS_INTRTXE_EP7TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP7TXEN_Pos)) /* Assigment of value for EP7TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_Msk                     _UINT16_(0x00FF)                                     /* (USBHS_INTRTXE) Register Mask  */


/* -------- USBHS_INTRUSB : (USBHS Offset: 0x100A) ( R/ 8) Read Only Register Which Indicates Which USB Interrupts Are Currently Active. -------- */
#define USBHS_INTRUSB_RESETVALUE              _UINT8_(0x00)                                        /*  (USBHS_INTRUSB) Read Only Register Which Indicates Which USB Interrupts Are Currently Active.  Reset Value */

#define USBHS_INTRUSB_SUSPEND_Pos             _UINT8_(0)                                           /* (USBHS_INTRUSB) Set When Suspend Signal Is Detected On The Bus Position */
#define USBHS_INTRUSB_SUSPEND_Msk             (_UINT8_(0x1) << USBHS_INTRUSB_SUSPEND_Pos)          /* (USBHS_INTRUSB) Set When Suspend Signal Is Detected On The Bus Mask */
#define USBHS_INTRUSB_SUSPEND(value)          (USBHS_INTRUSB_SUSPEND_Msk & (_UINT8_(value) << USBHS_INTRUSB_SUSPEND_Pos)) /* Assigment of value for SUSPEND in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_RESUME_Pos              _UINT8_(1)                                           /* (USBHS_INTRUSB) Set When Resume Signal Is Detected On The Bus Position */
#define USBHS_INTRUSB_RESUME_Msk              (_UINT8_(0x1) << USBHS_INTRUSB_RESUME_Pos)           /* (USBHS_INTRUSB) Set When Resume Signal Is Detected On The Bus Mask */
#define USBHS_INTRUSB_RESUME(value)           (USBHS_INTRUSB_RESUME_Msk & (_UINT8_(value) << USBHS_INTRUSB_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_RESET_Pos               _UINT8_(2)                                           /* (USBHS_INTRUSB) Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected Position */
#define USBHS_INTRUSB_RESET_Msk               (_UINT8_(0x1) << USBHS_INTRUSB_RESET_Pos)            /* (USBHS_INTRUSB) Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected Mask */
#define USBHS_INTRUSB_RESET(value)            (USBHS_INTRUSB_RESET_Msk & (_UINT8_(value) << USBHS_INTRUSB_RESET_Pos)) /* Assigment of value for RESET in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_SOF_Pos                 _UINT8_(3)                                           /* (USBHS_INTRUSB) Set When A New Frame Starts Position */
#define USBHS_INTRUSB_SOF_Msk                 (_UINT8_(0x1) << USBHS_INTRUSB_SOF_Pos)              /* (USBHS_INTRUSB) Set When A New Frame Starts Mask */
#define USBHS_INTRUSB_SOF(value)              (USBHS_INTRUSB_SOF_Msk & (_UINT8_(value) << USBHS_INTRUSB_SOF_Pos)) /* Assigment of value for SOF in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_CONN_Pos                _UINT8_(4)                                           /* (USBHS_INTRUSB) Set When A Device Connection Is Detected Position */
#define USBHS_INTRUSB_CONN_Msk                (_UINT8_(0x1) << USBHS_INTRUSB_CONN_Pos)             /* (USBHS_INTRUSB) Set When A Device Connection Is Detected Mask */
#define USBHS_INTRUSB_CONN(value)             (USBHS_INTRUSB_CONN_Msk & (_UINT8_(value) << USBHS_INTRUSB_CONN_Pos)) /* Assigment of value for CONN in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_DISCON_Pos              _UINT8_(5)                                           /* (USBHS_INTRUSB) Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends Position */
#define USBHS_INTRUSB_DISCON_Msk              (_UINT8_(0x1) << USBHS_INTRUSB_DISCON_Pos)           /* (USBHS_INTRUSB) Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends Mask */
#define USBHS_INTRUSB_DISCON(value)           (USBHS_INTRUSB_DISCON_Msk & (_UINT8_(value) << USBHS_INTRUSB_DISCON_Pos)) /* Assigment of value for DISCON in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_SESSREQ_Pos             _UINT8_(6)                                           /* (USBHS_INTRUSB) Set When Session Request Signaling Has Been Detected. Position */
#define USBHS_INTRUSB_SESSREQ_Msk             (_UINT8_(0x1) << USBHS_INTRUSB_SESSREQ_Pos)          /* (USBHS_INTRUSB) Set When Session Request Signaling Has Been Detected. Mask */
#define USBHS_INTRUSB_SESSREQ(value)          (USBHS_INTRUSB_SESSREQ_Msk & (_UINT8_(value) << USBHS_INTRUSB_SESSREQ_Pos)) /* Assigment of value for SESSREQ in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_VBUSERR_Pos             _UINT8_(7)                                           /* (USBHS_INTRUSB) Set When VBus Drops Below The VBus Valid Threshold During A Session. Position */
#define USBHS_INTRUSB_VBUSERR_Msk             (_UINT8_(0x1) << USBHS_INTRUSB_VBUSERR_Pos)          /* (USBHS_INTRUSB) Set When VBus Drops Below The VBus Valid Threshold During A Session. Mask */
#define USBHS_INTRUSB_VBUSERR(value)          (USBHS_INTRUSB_VBUSERR_Msk & (_UINT8_(value) << USBHS_INTRUSB_VBUSERR_Pos)) /* Assigment of value for VBUSERR in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_Msk                     _UINT8_(0xFF)                                        /* (USBHS_INTRUSB) Register Mask  */


/* -------- USBHS_INTRUSBE : (USBHS Offset: 0x100B) (R/W 8) Interrupt Enable Bits for USB Interrupts -------- */
#define USBHS_INTRUSBE_RESETVALUE             _UINT8_(0x06)                                        /*  (USBHS_INTRUSBE) Interrupt Enable Bits for USB Interrupts  Reset Value */

