Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_INTRUSBE_SUSPENDEN_Pos          _UINT8_(0)                                           /* (USBHS_INTRUSBE) SUSEPND Interrupt Enable Position */
#define USBHS_INTRUSBE_SUSPENDEN_Msk          (_UINT8_(0x1) << USBHS_INTRUSBE_SUSPENDEN_Pos)       /* (USBHS_INTRUSBE) SUSEPND Interrupt Enable Mask */
#define USBHS_INTRUSBE_SUSPENDEN(value)       (USBHS_INTRUSBE_SUSPENDEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_SUSPENDEN_Pos)) /* Assigment of value for SUSPENDEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_RESUMEEN_Pos           _UINT8_(1)                                           /* (USBHS_INTRUSBE) RESUME Interrupt Enable Position */
#define USBHS_INTRUSBE_RESUMEEN_Msk           (_UINT8_(0x1) << USBHS_INTRUSBE_RESUMEEN_Pos)        /* (USBHS_INTRUSBE) RESUME Interrupt Enable Mask */
#define USBHS_INTRUSBE_RESUMEEN(value)        (USBHS_INTRUSBE_RESUMEEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_RESUMEEN_Pos)) /* Assigment of value for RESUMEEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_RESETEN_Pos            _UINT8_(2)                                           /* (USBHS_INTRUSBE) RESET/BABBLE Interrupt Enable Position */
#define USBHS_INTRUSBE_RESETEN_Msk            (_UINT8_(0x1) << USBHS_INTRUSBE_RESETEN_Pos)         /* (USBHS_INTRUSBE) RESET/BABBLE Interrupt Enable Mask */
#define USBHS_INTRUSBE_RESETEN(value)         (USBHS_INTRUSBE_RESETEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_RESETEN_Pos)) /* Assigment of value for RESETEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_SOFEN_Pos              _UINT8_(3)                                           /* (USBHS_INTRUSBE) SOF Interrupt Enable Position */
#define USBHS_INTRUSBE_SOFEN_Msk              (_UINT8_(0x1) << USBHS_INTRUSBE_SOFEN_Pos)           /* (USBHS_INTRUSBE) SOF Interrupt Enable Mask */
#define USBHS_INTRUSBE_SOFEN(value)           (USBHS_INTRUSBE_SOFEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_SOFEN_Pos)) /* Assigment of value for SOFEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_CONNEN_Pos             _UINT8_(4)                                           /* (USBHS_INTRUSBE) CONN Interrupt Enable Position */
#define USBHS_INTRUSBE_CONNEN_Msk             (_UINT8_(0x1) << USBHS_INTRUSBE_CONNEN_Pos)          /* (USBHS_INTRUSBE) CONN Interrupt Enable Mask */
#define USBHS_INTRUSBE_CONNEN(value)          (USBHS_INTRUSBE_CONNEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_CONNEN_Pos)) /* Assigment of value for CONNEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_DISCONEN_Pos           _UINT8_(5)                                           /* (USBHS_INTRUSBE) DISCONN Interrupt Enable Position */
#define USBHS_INTRUSBE_DISCONEN_Msk           (_UINT8_(0x1) << USBHS_INTRUSBE_DISCONEN_Pos)        /* (USBHS_INTRUSBE) DISCONN Interrupt Enable Mask */
#define USBHS_INTRUSBE_DISCONEN(value)        (USBHS_INTRUSBE_DISCONEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_DISCONEN_Pos)) /* Assigment of value for DISCONEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_SESSREQEN_Pos          _UINT8_(6)                                           /* (USBHS_INTRUSBE) SESSREQ Interrupt Enable Position */
#define USBHS_INTRUSBE_SESSREQEN_Msk          (_UINT8_(0x1) << USBHS_INTRUSBE_SESSREQEN_Pos)       /* (USBHS_INTRUSBE) SESSREQ Interrupt Enable Mask */
#define USBHS_INTRUSBE_SESSREQEN(value)       (USBHS_INTRUSBE_SESSREQEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_SESSREQEN_Pos)) /* Assigment of value for SESSREQEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_VBUSERREN_Pos          _UINT8_(7)                                           /* (USBHS_INTRUSBE) VBus Error Interrupt Enable Position */
#define USBHS_INTRUSBE_VBUSERREN_Msk          (_UINT8_(0x1) << USBHS_INTRUSBE_VBUSERREN_Pos)       /* (USBHS_INTRUSBE) VBus Error Interrupt Enable Mask */
#define USBHS_INTRUSBE_VBUSERREN(value)       (USBHS_INTRUSBE_VBUSERREN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_VBUSERREN_Pos)) /* Assigment of value for VBUSERREN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_Msk                    _UINT8_(0xFF)                                        /* (USBHS_INTRUSBE) Register Mask  */


/* -------- USBHS_LINKINFO : (USBHS Offset: 0x107A) (R/W 8) Allows Some Delays To Be Specified -------- */
#define USBHS_LINKINFO_RESETVALUE             _UINT8_(0x5C)                                        /*  (USBHS_LINKINFO) Allows Some Delays To Be Specified  Reset Value */

#define USBHS_LINKINFO_WTID_Pos               _UINT8_(0)                                           /* (USBHS_LINKINFO) sets the delay to be applied from idpullup being asserted to iddig being considered valid in units of 4.369ms Position */
#define USBHS_LINKINFO_WTID_Msk               (_UINT8_(0xF) << USBHS_LINKINFO_WTID_Pos)            /* (USBHS_LINKINFO) sets the delay to be applied from idpullup being asserted to iddig being considered valid in units of 4.369ms Mask */
#define USBHS_LINKINFO_WTID(value)            (USBHS_LINKINFO_WTID_Msk & (_UINT8_(value) << USBHS_LINKINFO_WTID_Pos)) /* Assigment of value for WTID in the USBHS_LINKINFO register */
#define USBHS_LINKINFO_WTCON_Pos              _UINT8_(4)                                           /* (USBHS_LINKINFO) sets the wait to be applied to allow for the user's connect/disconnect filter in units of 533.3ns Position */
#define USBHS_LINKINFO_WTCON_Msk              (_UINT8_(0xF) << USBHS_LINKINFO_WTCON_Pos)           /* (USBHS_LINKINFO) sets the wait to be applied to allow for the user's connect/disconnect filter in units of 533.3ns Mask */
#define USBHS_LINKINFO_WTCON(value)           (USBHS_LINKINFO_WTCON_Msk & (_UINT8_(value) << USBHS_LINKINFO_WTCON_Pos)) /* Assigment of value for WTCON in the USBHS_LINKINFO register */
#define USBHS_LINKINFO_Msk                    _UINT8_(0xFF)                                        /* (USBHS_LINKINFO) Register Mask  */


/* -------- USBHS_LPMATTR : (USBHS Offset: 0x1360) (R/W 16) Defines The Attributes Of An LPM Transaction And Sleep Cycle. -------- */
#define USBHS_LPMATTR_RESETVALUE              _UINT16_(0x00)                                       /*  (USBHS_LPMATTR) Defines The Attributes Of An LPM Transaction And Sleep Cycle.  Reset Value */

#define USBHS_LPMATTR_LINKSTATE_Pos           _UINT16_(0)                                          /* (USBHS_LPMATTR) this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction. Position */
#define USBHS_LPMATTR_LINKSTATE_Msk           (_UINT16_(0xF) << USBHS_LPMATTR_LINKSTATE_Pos)       /* (USBHS_LPMATTR) this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction. Mask */
#define USBHS_LPMATTR_LINKSTATE(value)        (USBHS_LPMATTR_LINKSTATE_Msk & (_UINT16_(value) << USBHS_LPMATTR_LINKSTATE_Pos)) /* Assigment of value for LINKSTATE in the USBHS_LPMATTR register */
#define   USBHS_LPMATTR_LINKSTATE_SLEEPSTATE_Val _UINT16_(0x1)                                        /* (USBHS_LPMATTR) Sleep State (L1)  */
#define USBHS_LPMATTR_LINKSTATE_SLEEPSTATE    (USBHS_LPMATTR_LINKSTATE_SLEEPSTATE_Val << USBHS_LPMATTR_LINKSTATE_Pos) /* (USBHS_LPMATTR) Sleep State (L1) Position  */
#define USBHS_LPMATTR_HIRD_Pos                _UINT16_(4)                                          /* (USBHS_LPMATTR) this is the host initiated resume duration. Position */
#define USBHS_LPMATTR_HIRD_Msk                (_UINT16_(0xF) << USBHS_LPMATTR_HIRD_Pos)            /* (USBHS_LPMATTR) this is the host initiated resume duration. Mask */
#define USBHS_LPMATTR_HIRD(value)             (USBHS_LPMATTR_HIRD_Msk & (_UINT16_(value) << USBHS_LPMATTR_HIRD_Pos)) /* Assigment of value for HIRD in the USBHS_LPMATTR register */
#define USBHS_LPMATTR_RMTWAK_Pos              _UINT16_(8)                                          /* (USBHS_LPMATTR) this bit is the remote wakeup enable bit. Position */
#define USBHS_LPMATTR_RMTWAK_Msk              (_UINT16_(0x1) << USBHS_LPMATTR_RMTWAK_Pos)          /* (USBHS_LPMATTR) this bit is the remote wakeup enable bit. Mask */
#define USBHS_LPMATTR_RMTWAK(value)           (USBHS_LPMATTR_RMTWAK_Msk & (_UINT16_(value) << USBHS_LPMATTR_RMTWAK_Pos)) /* Assigment of value for RMTWAK in the USBHS_LPMATTR register */
#define USBHS_LPMATTR_ENDPOINT_Pos            _UINT16_(12)                                         /* (USBHS_LPMATTR) this is the endpnt that in the token packet of the lpm transaction. Position */
#define USBHS_LPMATTR_ENDPOINT_Msk            (_UINT16_(0xF) << USBHS_LPMATTR_ENDPOINT_Pos)        /* (USBHS_LPMATTR) this is the endpnt that in the token packet of the lpm transaction. Mask */
#define USBHS_LPMATTR_ENDPOINT(value)         (USBHS_LPMATTR_ENDPOINT_Msk & (_UINT16_(value) << USBHS_LPMATTR_ENDPOINT_Pos)) /* Assigment of value for ENDPOINT in the USBHS_LPMATTR register */
#define USBHS_LPMATTR_Msk                     _UINT16_(0xF1FF)                                     /* (USBHS_LPMATTR) Register Mask  */


/* -------- USBHS_LPMCNTRL : (USBHS Offset: 0x1362) (R/W 8) LPM Control Register -------- */
#define USBHS_LPMCNTRL_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_LPMCNTRL) LPM Control Register  Reset Value */

#define USBHS_LPMCNTRL_Msk                    _UINT8_(0x00)                                        /* (USBHS_LPMCNTRL) Register Mask  */

/* HOST mode */
#define USBHS_LPMCNTRL_HOST_LPMXMT_Pos        _UINT8_(0)                                           /* (USBHS_LPMCNTRL) software should set this bit to transmit an lpm transaction. Position */
#define USBHS_LPMCNTRL_HOST_LPMXMT_Msk        (_UINT8_(0x1) << USBHS_LPMCNTRL_HOST_LPMXMT_Pos)     /* (USBHS_LPMCNTRL) software should set this bit to transmit an lpm transaction. Mask */
#define USBHS_LPMCNTRL_HOST_LPMXMT(value)     (USBHS_LPMCNTRL_HOST_LPMXMT_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_HOST_LPMXMT_Pos))
#define USBHS_LPMCNTRL_HOST_LPMRES_Pos        _UINT8_(1)                                           /* (USBHS_LPMCNTRL) this bit is used by software to initiate a resume from the l1 state Position */
#define USBHS_LPMCNTRL_HOST_LPMRES_Msk        (_UINT8_(0x1) << USBHS_LPMCNTRL_HOST_LPMRES_Pos)     /* (USBHS_LPMCNTRL) this bit is used by software to initiate a resume from the l1 state Mask */
#define USBHS_LPMCNTRL_HOST_LPMRES(value)     (USBHS_LPMCNTRL_HOST_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_HOST_LPMRES_Pos))
#define USBHS_LPMCNTRL_HOST_Msk               _UINT8_(0x03)                                         /* (USBHS_LPMCNTRL_HOST) Register Mask  */

/* PERIPHERAL mode */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Pos  _UINT8_(0)                                           /* (USBHS_LPMCNTRL) this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction. Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Msk  (_UINT8_(0x1) << USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Pos) /* (USBHS_LPMCNTRL) this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction. Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMXMT(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Pos))
#define USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Pos  _UINT8_(1)                                           /* (USBHS_LPMCNTRL) this bit is used by software to initiate resume (remote wakeup). Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Msk  (_UINT8_(0x1) << USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Pos) /* (USBHS_LPMCNTRL) this bit is used by software to initiate resume (remote wakeup). Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMRES(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Pos))
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos   _UINT8_(2)                                           /* (USBHS_LPMCNTRL) this register is used to enable lpm in the musbmhdrc. Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Msk   (_UINT8_(0x3) << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) this register is used to enable lpm in the musbmhdrc. Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos))
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_LPMTRANS_Val _UINT8_(0x0)                                         /* (USBHS_LPMCNTRL) Core supports LPM extended transactions  */
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_EXTNTRANS_Val _UINT8_(0x1)                                         /* (USBHS_LPMCNTRL) LPM is not supported but extended transactions are supported.  */
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED1_Val _UINT8_(0x2)                                         /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported  */
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED2_Val _UINT8_(0x3)                                         /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_LPMTRANS (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_LPMTRANS_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) Core supports LPM extended transactions Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_EXTNTRANS (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_EXTNTRANS_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) LPM is not supported but extended transactions are supported. Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED1 (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED1_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED2 (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED2_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Pos  _UINT8_(4)                                           /* (USBHS_LPMCNTRL) this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak. Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Msk  (_UINT8_(0x1) << USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Pos) /* (USBHS_LPMCNTRL) this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak. Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMNAK(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Pos))
#define USBHS_LPMCNTRL_PERIPHERAL_Msk         _UINT8_(0x1F)                                         /* (USBHS_LPMCNTRL_PERIPHERAL) Register Mask  */


