Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_LPMFADDR : (USBHS Offset: 0x1365) (R/W 8) Function Address In LPM Payload -------- */
#define USBHS_LPMFADDR_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_LPMFADDR) Function Address In LPM Payload  Reset Value */

#define USBHS_LPMFADDR_FUNCADDR_Pos           _UINT8_(0)                                           /* (USBHS_LPMFADDR) function address that will be placed in the LPM payload Position */
#define USBHS_LPMFADDR_FUNCADDR_Msk           (_UINT8_(0x7F) << USBHS_LPMFADDR_FUNCADDR_Pos)       /* (USBHS_LPMFADDR) function address that will be placed in the LPM payload Mask */
#define USBHS_LPMFADDR_FUNCADDR(value)        (USBHS_LPMFADDR_FUNCADDR_Msk & (_UINT8_(value) << USBHS_LPMFADDR_FUNCADDR_Pos)) /* Assigment of value for FUNCADDR in the USBHS_LPMFADDR register */
#define USBHS_LPMFADDR_Msk                    _UINT8_(0x7F)                                        /* (USBHS_LPMFADDR) Register Mask  */


/* -------- USBHS_LPMINTR : (USBHS Offset: 0x1364) (R/W 8) Status Of The LPM Power State -------- */
#define USBHS_LPMINTR_RESETVALUE              _UINT8_(0x00)                                        /*  (USBHS_LPMINTR) Status Of The LPM Power State  Reset Value */

#define USBHS_LPMINTR_Msk                     _UINT8_(0x00)                                        /* (USBHS_LPMINTR) Register Mask  */

/* HOST mode */
#define USBHS_LPMINTR_HOST_LPMST_Pos          _UINT8_(0)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a stall. Position */
#define USBHS_LPMINTR_HOST_LPMST_Msk          (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMST_Pos)       /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a stall. Mask */
#define USBHS_LPMINTR_HOST_LPMST(value)       (USBHS_LPMINTR_HOST_LPMST_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMST_Pos))
#define USBHS_LPMINTR_HOST_LPMNY_Pos          _UINT8_(1)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a nyet. Position */
#define USBHS_LPMINTR_HOST_LPMNY_Msk          (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMNY_Pos)       /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a nyet. Mask */
#define USBHS_LPMINTR_HOST_LPMNY(value)       (USBHS_LPMINTR_HOST_LPMNY_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMNY_Pos))
#define USBHS_LPMINTR_HOST_LPMACK_Pos         _UINT8_(2)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with an ack. Position */
#define USBHS_LPMINTR_HOST_LPMACK_Msk         (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMACK_Pos)      /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with an ack. Mask */
#define USBHS_LPMINTR_HOST_LPMACK(value)      (USBHS_LPMINTR_HOST_LPMACK_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMACK_Pos))
#define USBHS_LPMINTR_HOST_LPMNC_Pos          _UINT8_(3)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction has been transmitted and has failed to complete. Position */
#define USBHS_LPMINTR_HOST_LPMNC_Msk          (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMNC_Pos)       /* (USBHS_LPMINTR) this bit is set when an lpm transaction has been transmitted and has failed to complete. Mask */
#define USBHS_LPMINTR_HOST_LPMNC(value)       (USBHS_LPMINTR_HOST_LPMNC_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMNC_Pos))
#define USBHS_LPMINTR_HOST_LPMRES_Pos         _UINT8_(4)                                           /* (USBHS_LPMINTR) this bit is set when the core has been resumed for any reason. Position */
#define USBHS_LPMINTR_HOST_LPMRES_Msk         (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMRES_Pos)      /* (USBHS_LPMINTR) this bit is set when the core has been resumed for any reason. Mask */
#define USBHS_LPMINTR_HOST_LPMRES(value)      (USBHS_LPMINTR_HOST_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMRES_Pos))
#define USBHS_LPMINTR_HOST_LPMERR_Pos         _UINT8_(5)                                           /* (USBHS_LPMINTR) this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error Position */
#define USBHS_LPMINTR_HOST_LPMERR_Msk         (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMERR_Pos)      /* (USBHS_LPMINTR) this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error Mask */
#define USBHS_LPMINTR_HOST_LPMERR(value)      (USBHS_LPMINTR_HOST_LPMERR_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMERR_Pos))
#define USBHS_LPMINTR_HOST_Msk                _UINT8_(0x3F)                                         /* (USBHS_LPMINTR_HOST) Register Mask  */

/* PERIPHERAL mode */
#define USBHS_LPMINTR_PERIPHERAL_LPMST_Pos    _UINT8_(0)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a stall. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMST_Msk    (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMST_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a stall. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMST(value) (USBHS_LPMINTR_PERIPHERAL_LPMST_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMST_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMNY_Pos    _UINT8_(1)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMNY_Msk    (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMNY_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMNY(value) (USBHS_LPMINTR_PERIPHERAL_LPMNY_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMNY_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMACK_Pos   _UINT8_(2)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with an ack. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMACK_Msk   (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMACK_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with an ack. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMACK(value) (USBHS_LPMINTR_PERIPHERAL_LPMACK_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMACK_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMNC_Pos    _UINT8_(3)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMNC_Msk    (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMNC_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMNC(value) (USBHS_LPMINTR_PERIPHERAL_LPMNC_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMNC_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMRES_Pos   _UINT8_(4)                                           /* (USBHS_LPMINTR) this bit is set if the core has been resumed for any reason. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMRES_Msk   (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMRES_Pos) /* (USBHS_LPMINTR) this bit is set if the core has been resumed for any reason. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMRES(value) (USBHS_LPMINTR_PERIPHERAL_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMRES_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMERR_Pos   _UINT8_(5)                                           /* (USBHS_LPMINTR) this bit is set if an lpm transaction is received that has a linkstate field that is not supported Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMERR_Msk   (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMERR_Pos) /* (USBHS_LPMINTR) this bit is set if an lpm transaction is received that has a linkstate field that is not supported Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMERR(value) (USBHS_LPMINTR_PERIPHERAL_LPMERR_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMERR_Pos))
#define USBHS_LPMINTR_PERIPHERAL_Msk          _UINT8_(0x3F)                                         /* (USBHS_LPMINTR_PERIPHERAL) Register Mask  */


