Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_LPMINTREN : (USBHS Offset: 0x1363) (R/W 8) LPM Interrupts Enable Register -------- */
#define USBHS_LPMINTREN_RESETVALUE            _UINT8_(0x00)                                        /*  (USBHS_LPMINTREN) LPM Interrupts Enable Register  Reset Value */

#define USBHS_LPMINTREN_LPMSTEN_Pos           _UINT8_(0)                                           /* (USBHS_LPMINTREN) LPMMST interrupt Position */
#define USBHS_LPMINTREN_LPMSTEN_Msk           (_UINT8_(0x1) << USBHS_LPMINTREN_LPMSTEN_Pos)        /* (USBHS_LPMINTREN) LPMMST interrupt Mask */
#define USBHS_LPMINTREN_LPMSTEN(value)        (USBHS_LPMINTREN_LPMSTEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMSTEN_Pos)) /* Assigment of value for LPMSTEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMNYEN_Pos           _UINT8_(1)                                           /* (USBHS_LPMINTREN) LPMMNY interrupt Position */
#define USBHS_LPMINTREN_LPMNYEN_Msk           (_UINT8_(0x1) << USBHS_LPMINTREN_LPMNYEN_Pos)        /* (USBHS_LPMINTREN) LPMMNY interrupt Mask */
#define USBHS_LPMINTREN_LPMNYEN(value)        (USBHS_LPMINTREN_LPMNYEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMNYEN_Pos)) /* Assigment of value for LPMNYEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMACKEN_Pos          _UINT8_(2)                                           /* (USBHS_LPMINTREN) LPMACK interrupt Position */
#define USBHS_LPMINTREN_LPMACKEN_Msk          (_UINT8_(0x1) << USBHS_LPMINTREN_LPMACKEN_Pos)       /* (USBHS_LPMINTREN) LPMACK interrupt Mask */
#define USBHS_LPMINTREN_LPMACKEN(value)       (USBHS_LPMINTREN_LPMACKEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMACKEN_Pos)) /* Assigment of value for LPMACKEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMNCEN_Pos           _UINT8_(3)                                           /* (USBHS_LPMINTREN) LPMNC interrupt Position */
#define USBHS_LPMINTREN_LPMNCEN_Msk           (_UINT8_(0x1) << USBHS_LPMINTREN_LPMNCEN_Pos)        /* (USBHS_LPMINTREN) LPMNC interrupt Mask */
#define USBHS_LPMINTREN_LPMNCEN(value)        (USBHS_LPMINTREN_LPMNCEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMNCEN_Pos)) /* Assigment of value for LPMNCEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMRESEN_Pos          _UINT8_(4)                                           /* (USBHS_LPMINTREN) LPMRES interrupt Position */
#define USBHS_LPMINTREN_LPMRESEN_Msk          (_UINT8_(0x1) << USBHS_LPMINTREN_LPMRESEN_Pos)       /* (USBHS_LPMINTREN) LPMRES interrupt Mask */
#define USBHS_LPMINTREN_LPMRESEN(value)       (USBHS_LPMINTREN_LPMRESEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMRESEN_Pos)) /* Assigment of value for LPMRESEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMERREN_Pos          _UINT8_(5)                                           /* (USBHS_LPMINTREN) LPMERR interrupt Position */
#define USBHS_LPMINTREN_LPMERREN_Msk          (_UINT8_(0x1) << USBHS_LPMINTREN_LPMERREN_Pos)       /* (USBHS_LPMINTREN) LPMERR interrupt Mask */
#define USBHS_LPMINTREN_LPMERREN(value)       (USBHS_LPMINTREN_LPMERREN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMERREN_Pos)) /* Assigment of value for LPMERREN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_Msk                   _UINT8_(0x3F)                                        /* (USBHS_LPMINTREN) Register Mask  */


/* -------- USBHS_LSEOF1 : (USBHS Offset: 0x107E) (R/W 8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions -------- */
#define USBHS_LSEOF1_RESETVALUE               _UINT8_(0x72)                                        /*  (USBHS_LSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions  Reset Value */

#define USBHS_LSEOF1_LSEOF1_Pos               _UINT8_(0)                                           /* (USBHS_LSEOF1) sets for low-speed transactions the time before eof to stop beginning new transactions, in units of 1.067us. (the default setting corresponds to 121.6us.) Position */
#define USBHS_LSEOF1_LSEOF1_Msk               (_UINT8_(0xFF) << USBHS_LSEOF1_LSEOF1_Pos)           /* (USBHS_LSEOF1) sets for low-speed transactions the time before eof to stop beginning new transactions, in units of 1.067us. (the default setting corresponds to 121.6us.) Mask */
#define USBHS_LSEOF1_LSEOF1(value)            (USBHS_LSEOF1_LSEOF1_Msk & (_UINT8_(value) << USBHS_LSEOF1_LSEOF1_Pos)) /* Assigment of value for LSEOF1 in the USBHS_LSEOF1 register */
#define USBHS_LSEOF1_Msk                      _UINT8_(0xFF)                                        /* (USBHS_LSEOF1) Register Mask  */


/* -------- USBHS_MISC : (USBHS Offset: 0x1061) (R/W 8) RX/TX Early DMA Enable Bits -------- */
#define USBHS_MISC_RESETVALUE                 _UINT8_(0x00)                                        /*  (USBHS_MISC) RX/TX Early DMA Enable Bits  Reset Value */

#define USBHS_MISC_RXEDMA_Pos                 _UINT8_(0)                                           /* (USBHS_MISC) DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection Position */
#define USBHS_MISC_RXEDMA_Msk                 (_UINT8_(0x1) << USBHS_MISC_RXEDMA_Pos)              /* (USBHS_MISC) DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection Mask */
#define USBHS_MISC_RXEDMA(value)              (USBHS_MISC_RXEDMA_Msk & (_UINT8_(value) << USBHS_MISC_RXEDMA_Pos)) /* Assigment of value for RXEDMA in the USBHS_MISC register */
#define   USBHS_MISC_RXEDMA_MAXP_Val          _UINT8_(0x0)                                         /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.  */
#define   USBHS_MISC_RXEDMA_MAXP_8_Val        _UINT8_(0x1)                                         /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.  */
#define USBHS_MISC_RXEDMA_MAXP                (USBHS_MISC_RXEDMA_MAXP_Val << USBHS_MISC_RXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode. Position  */
#define USBHS_MISC_RXEDMA_MAXP_8              (USBHS_MISC_RXEDMA_MAXP_8_Val << USBHS_MISC_RXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode. Position  */
#define USBHS_MISC_TXEDMA_Pos                 _UINT8_(1)                                           /* (USBHS_MISC) DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection Position */
#define USBHS_MISC_TXEDMA_Msk                 (_UINT8_(0x1) << USBHS_MISC_TXEDMA_Pos)              /* (USBHS_MISC) DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection Mask */
#define USBHS_MISC_TXEDMA(value)              (USBHS_MISC_TXEDMA_Msk & (_UINT8_(value) << USBHS_MISC_TXEDMA_Pos)) /* Assigment of value for TXEDMA in the USBHS_MISC register */
#define   USBHS_MISC_TXEDMA_MAXP_Val          _UINT8_(0x0)                                         /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.  */
#define   USBHS_MISC_TXEDMA_MAXP_8_Val        _UINT8_(0x1)                                         /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.  */
#define USBHS_MISC_TXEDMA_MAXP                (USBHS_MISC_TXEDMA_MAXP_Val << USBHS_MISC_TXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode. Position  */
#define USBHS_MISC_TXEDMA_MAXP_8              (USBHS_MISC_TXEDMA_MAXP_8_Val << USBHS_MISC_TXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode. Position  */
#define USBHS_MISC_Msk                        _UINT8_(0x03)                                        /* (USBHS_MISC) Register Mask  */


/* -------- USBHS_ENDPOINT0_NAKLIMIT0 : (USBHS Offset: 0x101B) (R/W 8) ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0. -------- */
#define USBHS_ENDPOINT0_NAKLIMIT0_RESETVALUE  _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_NAKLIMIT0) ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0.  Reset Value */

#define USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINT0_NAKLIMIT0) Number Of Frames/Microframes After Which Endpoint 0 Should Timeout Position */
#define USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Msk (_UINT8_(0x1F) << USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Pos) /* (USBHS_ENDPOINT0_NAKLIMIT0) Number Of Frames/Microframes After Which Endpoint 0 Should Timeout Mask */
#define USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT(value) (USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Pos)) /* Assigment of value for EP0NAKLIMIT in the USBHS_ENDPOINT0_NAKLIMIT0 register */
#define USBHS_ENDPOINT0_NAKLIMIT0_Msk         _UINT8_(0x1F)                                        /* (USBHS_ENDPOINT0_NAKLIMIT0) Register Mask  */


/* -------- USBHS_PHY00 : (USBHS Offset: 0x1500) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY00_RESETVALUE                _UINT32_(0x19)                                       /*  (USBHS_PHY00) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY00_PREEMP_Pos                _UINT32_(0)                                          /* (USBHS_PHY00) enables pre-emphasis Position */
#define USBHS_PHY00_PREEMP_Msk                (_UINT32_(0x7) << USBHS_PHY00_PREEMP_Pos)            /* (USBHS_PHY00) enables pre-emphasis Mask */
#define USBHS_PHY00_PREEMP(value)             (USBHS_PHY00_PREEMP_Msk & (_UINT32_(value) << USBHS_PHY00_PREEMP_Pos)) /* Assigment of value for PREEMP in the USBHS_PHY00 register */
#define   USBHS_PHY00_PREEMP_SOFEOP_Val       _UINT32_(0x0)                                        /* (USBHS_PHY00) Enable pre-emphasis during SOF and EOP  */
#define   USBHS_PHY00_PREEMP_CHIRP_Val        _UINT32_(0x1)                                        /* (USBHS_PHY00) Enable pre-emphasis during chirp  */
#define   USBHS_PHY00_PREEMP_NONCHIRP_Val     _UINT32_(0x2)                                        /* (USBHS_PHY00) Enable pre-emphasis in non-chirp state  */
#define   USBHS_PHY00_PREEMP_ALWAYS_Val       _UINT32_(0x3)                                        /* (USBHS_PHY00) Always enable pre-emphasis  */
#define USBHS_PHY00_PREEMP_SOFEOP             (USBHS_PHY00_PREEMP_SOFEOP_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Enable pre-emphasis during SOF and EOP Position  */
#define USBHS_PHY00_PREEMP_CHIRP              (USBHS_PHY00_PREEMP_CHIRP_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Enable pre-emphasis during chirp Position  */
#define USBHS_PHY00_PREEMP_NONCHIRP           (USBHS_PHY00_PREEMP_NONCHIRP_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Enable pre-emphasis in non-chirp state Position  */
#define USBHS_PHY00_PREEMP_ALWAYS             (USBHS_PHY00_PREEMP_ALWAYS_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Always enable pre-emphasis Position  */
#define USBHS_PHY00_SLEWRATE_Pos              _UINT32_(3)                                          /* (USBHS_PHY00) adjust FS/LS slew rate Position */
#define USBHS_PHY00_SLEWRATE_Msk              (_UINT32_(0x3) << USBHS_PHY00_SLEWRATE_Pos)          /* (USBHS_PHY00) adjust FS/LS slew rate Mask */
#define USBHS_PHY00_SLEWRATE(value)           (USBHS_PHY00_SLEWRATE_Msk & (_UINT32_(value) << USBHS_PHY00_SLEWRATE_Pos)) /* Assigment of value for SLEWRATE in the USBHS_PHY00 register */
#define   USBHS_PHY00_SLEWRATE_HIGH_Val       _UINT32_(0x0)                                        /* (USBHS_PHY00) Highest slew rate  */
#define   USBHS_PHY00_SLEWRATE_MIDDLE0_Val    _UINT32_(0x1)                                        /* (USBHS_PHY00) Middle slew rate  */
#define   USBHS_PHY00_SLEWRATE_MIDDLE1_Val    _UINT32_(0x2)                                        /* (USBHS_PHY00) Middle slew rate  */
#define   USBHS_PHY00_SLEWRATE_SMALLEST_Val   _UINT32_(0x3)                                        /* (USBHS_PHY00) Smallest slew rate  */
#define USBHS_PHY00_SLEWRATE_HIGH             (USBHS_PHY00_SLEWRATE_HIGH_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Highest slew rate Position  */
#define USBHS_PHY00_SLEWRATE_MIDDLE0          (USBHS_PHY00_SLEWRATE_MIDDLE0_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Middle slew rate Position  */
#define USBHS_PHY00_SLEWRATE_MIDDLE1          (USBHS_PHY00_SLEWRATE_MIDDLE1_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Middle slew rate Position  */
#define USBHS_PHY00_SLEWRATE_SMALLEST         (USBHS_PHY00_SLEWRATE_SMALLEST_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Smallest slew rate Position  */
#define USBHS_PHY00_RXPHSSEL_Pos              _UINT32_(5)                                          /* (USBHS_PHY00) RX clock phase select Position */
#define USBHS_PHY00_RXPHSSEL_Msk              (_UINT32_(0x7) << USBHS_PHY00_RXPHSSEL_Pos)          /* (USBHS_PHY00) RX clock phase select Mask */
#define USBHS_PHY00_RXPHSSEL(value)           (USBHS_PHY00_RXPHSSEL_Msk & (_UINT32_(value) << USBHS_PHY00_RXPHSSEL_Pos)) /* Assigment of value for RXPHSSEL in the USBHS_PHY00 register */
#define   USBHS_PHY00_RXPHSSEL_EARLIEST_Val   _UINT32_(0x0)                                        /* (USBHS_PHY00) Earliest phase  */
#define   USBHS_PHY00_RXPHSSEL_LATEST_Val     _UINT32_(0x7)                                        /* (USBHS_PHY00) Latest phase  */
#define USBHS_PHY00_RXPHSSEL_EARLIEST         (USBHS_PHY00_RXPHSSEL_EARLIEST_Val << USBHS_PHY00_RXPHSSEL_Pos) /* (USBHS_PHY00) Earliest phase Position  */
#define USBHS_PHY00_RXPHSSEL_LATEST           (USBHS_PHY00_RXPHSSEL_LATEST_Val << USBHS_PHY00_RXPHSSEL_Pos) /* (USBHS_PHY00) Latest phase Position  */
#define USBHS_PHY00_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY00) Register Mask  */


