Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_PHY4C : (USBHS Offset: 0x154C) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY4C_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_PHY4C) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY4C_VBUSVALTUNE_Pos           _UINT32_(0)                                          /* (USBHS_PHY4C) VBus_valid reference tuning Position */
#define USBHS_PHY4C_VBUSVALTUNE_Msk           (_UINT32_(0x7) << USBHS_PHY4C_VBUSVALTUNE_Pos)       /* (USBHS_PHY4C) VBus_valid reference tuning Mask */
#define USBHS_PHY4C_VBUSVALTUNE(value)        (USBHS_PHY4C_VBUSVALTUNE_Msk & (_UINT32_(value) << USBHS_PHY4C_VBUSVALTUNE_Pos)) /* Assigment of value for VBUSVALTUNE in the USBHS_PHY4C register */
#define USBHS_PHY4C_BSESSVALIDTUNE10_Pos      _UINT32_(6)                                          /* (USBHS_PHY4C) Lower 2 B_sessionvalid reference tune Position */
#define USBHS_PHY4C_BSESSVALIDTUNE10_Msk      (_UINT32_(0x3) << USBHS_PHY4C_BSESSVALIDTUNE10_Pos)  /* (USBHS_PHY4C) Lower 2 B_sessionvalid reference tune Mask */
#define USBHS_PHY4C_BSESSVALIDTUNE10(value)   (USBHS_PHY4C_BSESSVALIDTUNE10_Msk & (_UINT32_(value) << USBHS_PHY4C_BSESSVALIDTUNE10_Pos)) /* Assigment of value for BSESSVALIDTUNE10 in the USBHS_PHY4C register */
#define USBHS_PHY4C_Msk                       _UINT32_(0x000000C7)                                 /* (USBHS_PHY4C) Register Mask  */


/* -------- USBHS_PHY50 : (USBHS Offset: 0x1550) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY50_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_PHY50) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY50_BSESSVALIDTUNE2_Pos       _UINT32_(0)                                          /* (USBHS_PHY50) MSB of B_sessionvalid reference tune Position */
#define USBHS_PHY50_BSESSVALIDTUNE2_Msk       (_UINT32_(0x1) << USBHS_PHY50_BSESSVALIDTUNE2_Pos)   /* (USBHS_PHY50) MSB of B_sessionvalid reference tune Mask */
#define USBHS_PHY50_BSESSVALIDTUNE2(value)    (USBHS_PHY50_BSESSVALIDTUNE2_Msk & (_UINT32_(value) << USBHS_PHY50_BSESSVALIDTUNE2_Pos)) /* Assigment of value for BSESSVALIDTUNE2 in the USBHS_PHY50 register */
#define USBHS_PHY50_ASESSVALIDTUNE_Pos        _UINT32_(1)                                          /* (USBHS_PHY50) A_sessionvalid reference tune Position */
#define USBHS_PHY50_ASESSVALIDTUNE_Msk        (_UINT32_(0x7) << USBHS_PHY50_ASESSVALIDTUNE_Pos)    /* (USBHS_PHY50) A_sessionvalid reference tune Mask */
#define USBHS_PHY50_ASESSVALIDTUNE(value)     (USBHS_PHY50_ASESSVALIDTUNE_Msk & (_UINT32_(value) << USBHS_PHY50_ASESSVALIDTUNE_Pos)) /* Assigment of value for ASESSVALIDTUNE in the USBHS_PHY50 register */
#define USBHS_PHY50_COMPCURREF_Pos            _UINT32_(5)                                          /* (USBHS_PHY50) Compensation current tuning reference Position */
#define USBHS_PHY50_COMPCURREF_Msk            (_UINT32_(0x7) << USBHS_PHY50_COMPCURREF_Pos)        /* (USBHS_PHY50) Compensation current tuning reference Mask */
#define USBHS_PHY50_COMPCURREF(value)         (USBHS_PHY50_COMPCURREF_Msk & (_UINT32_(value) << USBHS_PHY50_COMPCURREF_Pos)) /* Assigment of value for COMPCURREF in the USBHS_PHY50 register */
#define USBHS_PHY50_Msk                       _UINT32_(0x000000EF)                                 /* (USBHS_PHY50) Register Mask  */

#define USBHS_PHY50_BSESSVALIDTUNE_Pos        _UINT32_(0)                                          /* (USBHS_PHY50 Position) MSB of B_sessionvalid reference tune */
#define USBHS_PHY50_BSESSVALIDTUNE_Msk        (_UINT32_(0x1) << USBHS_PHY50_BSESSVALIDTUNE_Pos)    /* (USBHS_PHY50 Mask) BSESSVALIDTUNE */
#define USBHS_PHY50_BSESSVALIDTUNE(value)     (USBHS_PHY50_BSESSVALIDTUNE_Msk & (_UINT32_(value) << USBHS_PHY50_BSESSVALIDTUNE_Pos)) 

/* -------- USBHS_POWER : (USBHS Offset: 0x1001) (R/W 8) Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE -------- */
#define USBHS_POWER_RESETVALUE                _UINT8_(0x20)                                        /*  (USBHS_POWER) Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE  Reset Value */

#define USBHS_POWER_ENABLESUSPENDM_Pos        _UINT8_(0)                                           /* (USBHS_POWER) set by the cpu to enable suspendm output Position */
#define USBHS_POWER_ENABLESUSPENDM_Msk        (_UINT8_(0x1) << USBHS_POWER_ENABLESUSPENDM_Pos)     /* (USBHS_POWER) set by the cpu to enable suspendm output Mask */
#define USBHS_POWER_ENABLESUSPENDM(value)     (USBHS_POWER_ENABLESUSPENDM_Msk & (_UINT8_(value) << USBHS_POWER_ENABLESUSPENDM_Pos)) /* Assigment of value for ENABLESUSPENDM in the USBHS_POWER register */
#define USBHS_POWER_SUSPENDMODE_Pos           _UINT8_(1)                                           /* (USBHS_POWER) set by cpu to enter suspend mode Position */
#define USBHS_POWER_SUSPENDMODE_Msk           (_UINT8_(0x1) << USBHS_POWER_SUSPENDMODE_Pos)        /* (USBHS_POWER) set by cpu to enter suspend mode Mask */
#define USBHS_POWER_SUSPENDMODE(value)        (USBHS_POWER_SUSPENDMODE_Msk & (_UINT8_(value) << USBHS_POWER_SUSPENDMODE_Pos)) /* Assigment of value for SUSPENDMODE in the USBHS_POWER register */
#define USBHS_POWER_RESUME_Pos                _UINT8_(2)                                           /* (USBHS_POWER) set by cpu to generate resume signaling when te device is in suspend Position */
#define USBHS_POWER_RESUME_Msk                (_UINT8_(0x1) << USBHS_POWER_RESUME_Pos)             /* (USBHS_POWER) set by cpu to generate resume signaling when te device is in suspend Mask */
#define USBHS_POWER_RESUME(value)             (USBHS_POWER_RESUME_Msk & (_UINT8_(value) << USBHS_POWER_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_POWER register */
#define USBHS_POWER_RESET_Pos                 _UINT8_(3)                                           /* (USBHS_POWER) this bit is set when reset signaling is present on the bus Position */
#define USBHS_POWER_RESET_Msk                 (_UINT8_(0x1) << USBHS_POWER_RESET_Pos)              /* (USBHS_POWER) this bit is set when reset signaling is present on the bus Mask */
#define USBHS_POWER_RESET(value)              (USBHS_POWER_RESET_Msk & (_UINT8_(value) << USBHS_POWER_RESET_Pos)) /* Assigment of value for RESET in the USBHS_POWER register */
#define USBHS_POWER_HSMODE_Pos                _UINT8_(4)                                           /* (USBHS_POWER) when set this read only bit indicates high speed mode successfully negotiated during usb reset Position */
#define USBHS_POWER_HSMODE_Msk                (_UINT8_(0x1) << USBHS_POWER_HSMODE_Pos)             /* (USBHS_POWER) when set this read only bit indicates high speed mode successfully negotiated during usb reset Mask */
#define USBHS_POWER_HSMODE(value)             (USBHS_POWER_HSMODE_Msk & (_UINT8_(value) << USBHS_POWER_HSMODE_Pos)) /* Assigment of value for HSMODE in the USBHS_POWER register */
#define USBHS_POWER_HSENABLE_Pos              _UINT8_(5)                                           /* (USBHS_POWER) when set by cpu the usbcore will negotiate the high speed mode Position */
#define USBHS_POWER_HSENABLE_Msk              (_UINT8_(0x1) << USBHS_POWER_HSENABLE_Pos)           /* (USBHS_POWER) when set by cpu the usbcore will negotiate the high speed mode Mask */
#define USBHS_POWER_HSENABLE(value)           (USBHS_POWER_HSENABLE_Msk & (_UINT8_(value) << USBHS_POWER_HSENABLE_Pos)) /* Assigment of value for HSENABLE in the USBHS_POWER register */
#define USBHS_POWER_SOFTCONN_Pos              _UINT8_(6)                                           /* (USBHS_POWER) if enabled the D+ D- lines are enabled when this bit is set by the cpu Position */
#define USBHS_POWER_SOFTCONN_Msk              (_UINT8_(0x1) << USBHS_POWER_SOFTCONN_Pos)           /* (USBHS_POWER) if enabled the D+ D- lines are enabled when this bit is set by the cpu Mask */
#define USBHS_POWER_SOFTCONN(value)           (USBHS_POWER_SOFTCONN_Msk & (_UINT8_(value) << USBHS_POWER_SOFTCONN_Pos)) /* Assigment of value for SOFTCONN in the USBHS_POWER register */
#define USBHS_POWER_ISOUPDATE_Pos             _UINT8_(7)                                           /* (USBHS_POWER) when set by cpu the usbcore will wait for an sof token Position */
#define USBHS_POWER_ISOUPDATE_Msk             (_UINT8_(0x1) << USBHS_POWER_ISOUPDATE_Pos)          /* (USBHS_POWER) when set by cpu the usbcore will wait for an sof token Mask */
#define USBHS_POWER_ISOUPDATE(value)          (USBHS_POWER_ISOUPDATE_Msk & (_UINT8_(value) << USBHS_POWER_ISOUPDATE_Pos)) /* Assigment of value for ISOUPDATE in the USBHS_POWER register */
#define USBHS_POWER_Msk                       _UINT8_(0xFF)                                        /* (USBHS_POWER) Register Mask  */


/* -------- USBHS_RAMINFO : (USBHS Offset: 0x1079) ( R/ 8) Details About Width Of RAM and DMA Channels -------- */
#define USBHS_RAMINFO_RESETVALUE              _UINT8_(0x8D)                                        /*  (USBHS_RAMINFO) Details About Width Of RAM and DMA Channels  Reset Value */

#define USBHS_RAMINFO_RAMBITS_Pos             _UINT8_(0)                                           /* (USBHS_RAMINFO) width of the ram address bus Position */
#define USBHS_RAMINFO_RAMBITS_Msk             (_UINT8_(0xF) << USBHS_RAMINFO_RAMBITS_Pos)          /* (USBHS_RAMINFO) width of the ram address bus Mask */
#define USBHS_RAMINFO_RAMBITS(value)          (USBHS_RAMINFO_RAMBITS_Msk & (_UINT8_(value) << USBHS_RAMINFO_RAMBITS_Pos)) /* Assigment of value for RAMBITS in the USBHS_RAMINFO register */
#define USBHS_RAMINFO_DMACHANS_Pos            _UINT8_(4)                                           /* (USBHS_RAMINFO) number of dma channels implemented in the design Position */
#define USBHS_RAMINFO_DMACHANS_Msk            (_UINT8_(0xF) << USBHS_RAMINFO_DMACHANS_Pos)         /* (USBHS_RAMINFO) number of dma channels implemented in the design Mask */
#define USBHS_RAMINFO_DMACHANS(value)         (USBHS_RAMINFO_DMACHANS_Msk & (_UINT8_(value) << USBHS_RAMINFO_DMACHANS_Pos)) /* Assigment of value for DMACHANS in the USBHS_RAMINFO register */
#define USBHS_RAMINFO_Msk                     _UINT8_(0xFF)                                        /* (USBHS_RAMINFO) Register Mask  */


/* -------- USBHS_RQPKTCOUNT : (USBHS Offset: 0x1304) (R/W 32) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer -------- */
#define USBHS_RQPKTCOUNT_RESETVALUE           _UINT32_(0x00)                                       /*  (USBHS_RQPKTCOUNT) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer  Reset Value */

