Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_RQPKTCOUNT_RQPKTCOUNT_Pos       _UINT32_(0)                                          /* (USBHS_RQPKTCOUNT) sets the number of packets of size maxp that are to be transferred in a block transfer. only used in host mode when autoreq is set. has no effect in peripheral mode or when autoreq is not set. Position */
#define USBHS_RQPKTCOUNT_RQPKTCOUNT_Msk       (_UINT32_(0xFFFF) << USBHS_RQPKTCOUNT_RQPKTCOUNT_Pos) /* (USBHS_RQPKTCOUNT) sets the number of packets of size maxp that are to be transferred in a block transfer. only used in host mode when autoreq is set. has no effect in peripheral mode or when autoreq is not set. Mask */
#define USBHS_RQPKTCOUNT_RQPKTCOUNT(value)    (USBHS_RQPKTCOUNT_RQPKTCOUNT_Msk & (_UINT32_(value) << USBHS_RQPKTCOUNT_RQPKTCOUNT_Pos)) /* Assigment of value for RQPKTCOUNT in the USBHS_RQPKTCOUNT register */
#define USBHS_RQPKTCOUNT_Msk                  _UINT32_(0x0000FFFF)                                 /* (USBHS_RQPKTCOUNT) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXCOUNT : (USBHS Offset: 0x1018) ( R/ 16) ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. -------- */
#define USBHS_ENDPOINTX_RXCOUNT_RESETVALUE    _UINT16_(0x00)                                       /*  (USBHS_ENDPOINTX_RXCOUNT) ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.  Reset Value */

#define USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Pos _UINT16_(0)                                          /* (USBHS_ENDPOINTX_RXCOUNT) Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. Position */
#define USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Msk (_UINT16_(0x3FFF) << USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Pos) /* (USBHS_ENDPOINTX_RXCOUNT) Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. Mask */
#define USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT(value) (USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Pos)) /* Assigment of value for ENDPOINTRXCOUNT in the USBHS_ENDPOINTX_RXCOUNT register */
#define USBHS_ENDPOINTX_RXCOUNT_Msk           _UINT16_(0x3FFF)                                     /* (USBHS_ENDPOINTX_RXCOUNT) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXCSRH : (USBHS Offset: 0x1017) (R/W 8) ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 -------- */
#define USBHS_ENDPOINTX_RXCSRH_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXCSRH) ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15  Reset Value */

#define USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Select DMA Request Mode Position */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Select DMA Request Mode Mask */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQMODE(value) (USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Pos)) /* Assigment of value for DMAREQMODE in the USBHS_ENDPOINTX_RXCSRH register */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Position */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Mask */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQENAB(value) (USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Pos)) /* Assigment of value for DMAREQENAB in the USBHS_ENDPOINTX_RXCSRH register */
#define USBHS_ENDPOINTX_RXCSRH_Msk            _UINT8_(0x28)                                        /* (USBHS_ENDPOINTX_RXCSRH) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Pos) /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_RXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Pos) /* (USBHS_ENDPOINTX_RXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXCSRH) Indicates A PID Error In The Received Packet Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Pos) /* (USBHS_ENDPOINTX_RXCSRH) Indicates A PID Error In The Received Packet Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, The ReqPkt Bit Will Be Automatically Set When The RxPktRdy Bit Is Cleared. Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Pos) /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, The ReqPkt Bit Will Be Automatically Set When The RxPktRdy Bit Is Cleared. Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Cleared When A Packet Of RxMaxP Bytes Has Been Unloaded From The RX FIFO Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Pos) /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Cleared When A Packet Of RxMaxP Bytes Has Been Unloaded From The RX FIFO Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_Msk   _UINT8_(0xD7)                                         /* (USBHS_ENDPOINTX_RXCSRH_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received. Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Pos) /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received. Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Disable The Sending Of NYET Handshakes Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Disable The Sending Of NYET Handshakes Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Pos) /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_Msk _UINT8_(0xD1)                                         /* (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXCSRL : (USBHS Offset: 0x1016) (R/W 8) ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 -------- */
#define USBHS_ENDPOINTX_RXCSRL_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXCSRL) ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15  Reset Value */

#define USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Pos   _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A Data Packet Has Been Received. Position */
#define USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Msk   (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A Data Packet Has Been Received. Mask */
#define USBHS_ENDPOINTX_RXCSRL_RXPKTRDY(value) (USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Pos)) /* Assigment of value for RXPKTRDY in the USBHS_ENDPOINTX_RXCSRL register */
#define USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Pos  _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO Position */
#define USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Msk  (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO Mask */
#define USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO(value) (USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Pos)) /* Assigment of value for FLUSHFIFO in the USBHS_ENDPOINTX_RXCSRL register */
#define USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Position */
#define USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Mask */
#define USBHS_ENDPOINTX_RXCSRL_CLRDATATOG(value) (USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Pos)) /* Assigment of value for CLRDATATOG in the USBHS_ENDPOINTX_RXCSRL register */
#define USBHS_ENDPOINTX_RXCSRL_Msk            _UINT8_(0x91)                                        /* (USBHS_ENDPOINTX_RXCSRL) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_RXCSRL) The USB Sets This Bit When 3 Attempts Have Been Made To Receive A Packet And No Data Packet Has Been Received. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The USB Sets This Bit When 3 Attempts Have Been Made To Receive A Packet And No Data Packet Has Been Received. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Request An IN Transaction. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Request An IN Transaction. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRL) When A STALL Handshake Is Received, This Bit Is Set And An Interrupt Is Generated. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) When A STALL Handshake Is Received, This Bit Is Set And An Interrupt Is Generated. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_Msk   _UINT8_(0x6E)                                         /* (USBHS_ENDPOINTX_RXCSRL_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Into The Rx FIFO. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Into The Rx FIFO. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set If An OUT Packet Cannot Be Loaded Into The Rx FIFO. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set If An OUT Packet Cannot Be Loaded Into The Rx FIFO. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Issue A STALL Handshake. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Issue A STALL Handshake. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A STALL Handshake Is Transmitted. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A STALL Handshake Is Transmitted. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_Msk _UINT8_(0x6E)                                         /* (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX) Register Mask  */


/* -------- USBHS_RXDPKTBUFDIS : (USBHS Offset: 0x1340) (R/W 16) Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality -------- */
#define USBHS_RXDPKTBUFDIS_RESETVALUE         _UINT16_(0x00)                                       /*  (USBHS_RXDPKTBUFDIS) Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality  Reset Value */

#define USBHS_RXDPKTBUFDIS_EPxRXDIS_Pos       _UINT16_(1)                                          /* (USBHS_RXDPKTBUFDIS) each bit indicates which of the Rx endpoint have disabled double buffer functionality Position */
#define USBHS_RXDPKTBUFDIS_EPxRXDIS_Msk       (_UINT16_(0x7FFF) << USBHS_RXDPKTBUFDIS_EPxRXDIS_Pos) /* (USBHS_RXDPKTBUFDIS) each bit indicates which of the Rx endpoint have disabled double buffer functionality Mask */
#define USBHS_RXDPKTBUFDIS_EPxRXDIS(value)    (USBHS_RXDPKTBUFDIS_EPxRXDIS_Msk & (_UINT16_(value) << USBHS_RXDPKTBUFDIS_EPxRXDIS_Pos)) /* Assigment of value for EPxRXDIS in the USBHS_RXDPKTBUFDIS register */
#define USBHS_RXDPKTBUFDIS_Msk                _UINT16_(0xFFFE)                                     /* (USBHS_RXDPKTBUFDIS) Register Mask  */


