Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_RXFIFOADD : (USBHS Offset: 0x1066) (R/W 16) Controls The Start Address Of the Selected RX Endpoint FIFO -------- */
#define USBHS_RXFIFOADD_RESETVALUE            _UINT16_(0x00)                                       /*  (USBHS_RXFIFOADD) Controls The Start Address Of the Selected RX Endpoint FIFO  Reset Value */

#define USBHS_RXFIFOADD_ADDR_Pos              _UINT16_(0)                                          /* (USBHS_RXFIFOADD) start address of the endpoint FIFO Position */
#define USBHS_RXFIFOADD_ADDR_Msk              (_UINT16_(0x1FFF) << USBHS_RXFIFOADD_ADDR_Pos)       /* (USBHS_RXFIFOADD) start address of the endpoint FIFO Mask */
#define USBHS_RXFIFOADD_ADDR(value)           (USBHS_RXFIFOADD_ADDR_Msk & (_UINT16_(value) << USBHS_RXFIFOADD_ADDR_Pos)) /* Assigment of value for ADDR in the USBHS_RXFIFOADD register */
#define USBHS_RXFIFOADD_Msk                   _UINT16_(0x1FFF)                                     /* (USBHS_RXFIFOADD) Register Mask  */


/* -------- USBHS_RXFIFOSZ : (USBHS Offset: 0x1063) (R/W 8) Controls The Size Of The Selected RX Endpoint FIFO -------- */
#define USBHS_RXFIFOSZ_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_RXFIFOSZ) Controls The Size Of The Selected RX Endpoint FIFO  Reset Value */

#define USBHS_RXFIFOSZ_SZ_Pos                 _UINT8_(0)                                           /* (USBHS_RXFIFOSZ) maximum packet size to be allowed Position */
#define USBHS_RXFIFOSZ_SZ_Msk                 (_UINT8_(0xF) << USBHS_RXFIFOSZ_SZ_Pos)              /* (USBHS_RXFIFOSZ) maximum packet size to be allowed Mask */
#define USBHS_RXFIFOSZ_SZ(value)              (USBHS_RXFIFOSZ_SZ_Msk & (_UINT8_(value) << USBHS_RXFIFOSZ_SZ_Pos)) /* Assigment of value for SZ in the USBHS_RXFIFOSZ register */
#define   USBHS_RXFIFOSZ_SZ_8BYTES_Val        _UINT8_(0x0)                                         /* (USBHS_RXFIFOSZ) 8 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_16BYTES_Val       _UINT8_(0x1)                                         /* (USBHS_RXFIFOSZ) 16 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_32BYTES_Val       _UINT8_(0x2)                                         /* (USBHS_RXFIFOSZ) 32 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_64BYTES_Val       _UINT8_(0x3)                                         /* (USBHS_RXFIFOSZ) 64 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_128BYTES_Val      _UINT8_(0x4)                                         /* (USBHS_RXFIFOSZ) 128 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_256BYTES_Val      _UINT8_(0x5)                                         /* (USBHS_RXFIFOSZ) 256 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_512BYTES_Val      _UINT8_(0x6)                                         /* (USBHS_RXFIFOSZ) 512 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_1024BYTES_Val     _UINT8_(0x7)                                         /* (USBHS_RXFIFOSZ) 1024 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_2048BYTES_Val     _UINT8_(0x8)                                         /* (USBHS_RXFIFOSZ) 2048 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_4096BYTES_Val     _UINT8_(0x9)                                         /* (USBHS_RXFIFOSZ) 4096 BYTES  */
#define USBHS_RXFIFOSZ_SZ_8BYTES              (USBHS_RXFIFOSZ_SZ_8BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 8 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_16BYTES             (USBHS_RXFIFOSZ_SZ_16BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 16 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_32BYTES             (USBHS_RXFIFOSZ_SZ_32BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 32 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_64BYTES             (USBHS_RXFIFOSZ_SZ_64BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 64 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_128BYTES            (USBHS_RXFIFOSZ_SZ_128BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 128 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_256BYTES            (USBHS_RXFIFOSZ_SZ_256BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 256 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_512BYTES            (USBHS_RXFIFOSZ_SZ_512BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 512 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_1024BYTES           (USBHS_RXFIFOSZ_SZ_1024BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 1024 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_2048BYTES           (USBHS_RXFIFOSZ_SZ_2048BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 2048 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_4096BYTES           (USBHS_RXFIFOSZ_SZ_4096BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 4096 BYTES Position  */
#define USBHS_RXFIFOSZ_DPB_Pos                _UINT8_(4)                                           /* (USBHS_RXFIFOSZ) double packet buffering enabled or not Position */
#define USBHS_RXFIFOSZ_DPB_Msk                (_UINT8_(0x1) << USBHS_RXFIFOSZ_DPB_Pos)             /* (USBHS_RXFIFOSZ) double packet buffering enabled or not Mask */
#define USBHS_RXFIFOSZ_DPB(value)             (USBHS_RXFIFOSZ_DPB_Msk & (_UINT8_(value) << USBHS_RXFIFOSZ_DPB_Pos)) /* Assigment of value for DPB in the USBHS_RXFIFOSZ register */
#define USBHS_RXFIFOSZ_Msk                    _UINT8_(0x1F)                                        /* (USBHS_RXFIFOSZ) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXINTERVAL : (USBHS Offset: 0x101D) (R/W 8) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint. -------- */
#define USBHS_ENDPOINTX_RXINTERVAL_RESETVALUE _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXINTERVAL) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint.  Reset Value */

#define USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXINTERVAL) polling interval Position */
#define USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Msk (_UINT8_(0xFF) << USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Pos) /* (USBHS_ENDPOINTX_RXINTERVAL) polling interval Mask */
#define USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL(value) (USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Pos)) /* Assigment of value for RXPOLLINGINTERVAL in the USBHS_ENDPOINTX_RXINTERVAL register */
#define USBHS_ENDPOINTX_RXINTERVAL_Msk        _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_RXINTERVAL) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXMAXP : (USBHS Offset: 0x1014) (R/W 16) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation -------- */
#define USBHS_ENDPOINTX_RXMAXP_RESETVALUE     _UINT16_(0x00)                                       /*  (USBHS_ENDPOINTX_RXMAXP) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation  Reset Value */

#define USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Pos _UINT16_(0)                                          /* (USBHS_ENDPOINTX_RXMAXP) Maximum Payload/Transactions Position */
#define USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Msk (_UINT16_(0x7FF) << USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Pos) /* (USBHS_ENDPOINTX_RXMAXP) Maximum Payload/Transactions Mask */
#define USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD(value) (USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Pos)) /* Assigment of value for MAXPAYLOAD in the USBHS_ENDPOINTX_RXMAXP register */
#define USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Pos _UINT16_(11)                                         /* (USBHS_ENDPOINTX_RXMAXP) Multiplier Value (m-1) Position */
#define USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Msk (_UINT16_(0x1F) << USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Pos) /* (USBHS_ENDPOINTX_RXMAXP) Multiplier Value (m-1) Mask */
#define USBHS_ENDPOINTX_RXMAXP_MULTIPLIER(value) (USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Pos)) /* Assigment of value for MULTIPLIER in the USBHS_ENDPOINTX_RXMAXP register */
#define USBHS_ENDPOINTX_RXMAXP_Msk            _UINT16_(0xFFFF)                                     /* (USBHS_ENDPOINTX_RXMAXP) Register Mask  */


