Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_ENDPOINTX_RXTYPE : (USBHS Offset: 0x101C) (R/W 8) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint -------- */
#define USBHS_ENDPOINTX_RXTYPE_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXTYPE) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint  Reset Value */

#define USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this value to the endpoint number contained in the rx endpoint descriptor returned to the musbmhdrc during device enumeration. Position */
#define USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Pos) /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this value to the endpoint number contained in the rx endpoint descriptor returned to the musbmhdrc during device enumeration. Mask */
#define USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER(value) (USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Pos)) /* Assigment of value for ENDPOINTNUMBER in the USBHS_ENDPOINTX_RXTYPE register */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos   _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this to select the required protocol for the rx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Position */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Msk   (_UINT8_(0x3) << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this to select the required protocol for the rx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Mask */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL(value) (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos)) /* Assigment of value for PROTOCOL in the USBHS_ENDPOINTX_RXTYPE register */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_CONTROL_Val _UINT8_(0x0)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_ISOCHRONOUS_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_BULK_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_INTERRUPT_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_CONTROL (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_CONTROL_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_ISOCHRONOUS (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_ISOCHRONOUS_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_BULK  (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_BULK_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_INTERRUPT (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_INTERRUPT_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_Pos      _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Position */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_Msk      (_UINT8_(0x3) << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos)   /* (USBHS_ENDPOINTX_RXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Mask */
#define USBHS_ENDPOINTX_RXTYPE_SPEED(value)   (USBHS_ENDPOINTX_RXTYPE_SPEED_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_ENDPOINTX_RXTYPE register */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_UNUSED_Val _UINT8_(0x0)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_HIGH_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_FULL_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_LOW_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_UNUSED   (USBHS_ENDPOINTX_RXTYPE_SPEED_UNUSED_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_HIGH     (USBHS_ENDPOINTX_RXTYPE_SPEED_HIGH_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_FULL     (USBHS_ENDPOINTX_RXTYPE_SPEED_FULL_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_LOW      (USBHS_ENDPOINTX_RXTYPE_SPEED_LOW_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_Msk            _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_RXTYPE) Register Mask  */


/* -------- USBHS_SOFTRST : (USBHS Offset: 0x107F) (R/W 8) Assert Low The Output Reset Signals NRSTO and NRSTXO -------- */
#define USBHS_SOFTRST_RESETVALUE              _UINT8_(0x00)                                        /*  (USBHS_SOFTRST) Assert Low The Output Reset Signals NRSTO and NRSTXO  Reset Value */

#define USBHS_SOFTRST_NRST_Pos                _UINT8_(0)                                           /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrsto will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrsto will be asynchronously asserted and synchronously de-asserted with respect to clk. Position */
#define USBHS_SOFTRST_NRST_Msk                (_UINT8_(0x1) << USBHS_SOFTRST_NRST_Pos)             /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrsto will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrsto will be asynchronously asserted and synchronously de-asserted with respect to clk. Mask */
#define USBHS_SOFTRST_NRST(value)             (USBHS_SOFTRST_NRST_Msk & (_UINT8_(value) << USBHS_SOFTRST_NRST_Pos)) /* Assigment of value for NRST in the USBHS_SOFTRST register */
#define USBHS_SOFTRST_NRSTX_Pos               _UINT8_(1)                                           /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrstxo will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrstxo will be asynchronously asserted and synchronously de-asserted with respect to xclk. Position */
#define USBHS_SOFTRST_NRSTX_Msk               (_UINT8_(0x1) << USBHS_SOFTRST_NRSTX_Pos)            /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrstxo will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrstxo will be asynchronously asserted and synchronously de-asserted with respect to xclk. Mask */
#define USBHS_SOFTRST_NRSTX(value)            (USBHS_SOFTRST_NRSTX_Msk & (_UINT8_(value) << USBHS_SOFTRST_NRSTX_Pos)) /* Assigment of value for NRSTX in the USBHS_SOFTRST register */
#define USBHS_SOFTRST_Msk                     _UINT8_(0x03)                                        /* (USBHS_SOFTRST) Register Mask  */


/* -------- USBHS_STATUS : (USBHS Offset: 0x18) ( R/ 32) USBHS Status Register -------- */
#define USBHS_STATUS_RESETVALUE               _UINT32_(0x00)                                       /*  (USBHS_STATUS) USBHS Status Register  Reset Value */

