Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_STATUS_PHYRDY_Pos               _UINT32_(0)                                          /* (USBHS_STATUS) PHY Is Ready for USBCORE Activity Position */
#define USBHS_STATUS_PHYRDY_Msk               (_UINT32_(0x1) << USBHS_STATUS_PHYRDY_Pos)           /* (USBHS_STATUS) PHY Is Ready for USBCORE Activity Mask */
#define USBHS_STATUS_PHYRDY(value)            (USBHS_STATUS_PHYRDY_Msk & (_UINT32_(value) << USBHS_STATUS_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_STATUS register */
#define USBHS_STATUS_PHYON_Pos                _UINT32_(1)                                          /* (USBHS_STATUS) Power On of PHY Complete Position */
#define USBHS_STATUS_PHYON_Msk                (_UINT32_(0x1) << USBHS_STATUS_PHYON_Pos)            /* (USBHS_STATUS) Power On of PHY Complete Mask */
#define USBHS_STATUS_PHYON(value)             (USBHS_STATUS_PHYON_Msk & (_UINT32_(value) << USBHS_STATUS_PHYON_Pos)) /* Assigment of value for PHYON in the USBHS_STATUS register */
#define USBHS_STATUS_VREGRDY_Pos              _UINT32_(2)                                          /* (USBHS_STATUS) USB Voltage Regulator Status Position */
#define USBHS_STATUS_VREGRDY_Msk              (_UINT32_(0x1) << USBHS_STATUS_VREGRDY_Pos)          /* (USBHS_STATUS) USB Voltage Regulator Status Mask */
#define USBHS_STATUS_VREGRDY(value)           (USBHS_STATUS_VREGRDY_Msk & (_UINT32_(value) << USBHS_STATUS_VREGRDY_Pos)) /* Assigment of value for VREGRDY in the USBHS_STATUS register */
#define USBHS_STATUS_Msk                      _UINT32_(0x00000007)                                 /* (USBHS_STATUS) Register Mask  */


/* -------- USBHS_SYNCBUSY : (USBHS Offset: 0x1C) ( R/ 32) USBHS Syncbusy Register -------- */
#define USBHS_SYNCBUSY_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_SYNCBUSY) USBHS Syncbusy Register  Reset Value */

#define USBHS_SYNCBUSY_SWRST_Pos              _UINT32_(0)                                          /* (USBHS_SYNCBUSY) Software reset busy bit Position */
#define USBHS_SYNCBUSY_SWRST_Msk              (_UINT32_(0x1) << USBHS_SYNCBUSY_SWRST_Pos)          /* (USBHS_SYNCBUSY) Software reset busy bit Mask */
#define USBHS_SYNCBUSY_SWRST(value)           (USBHS_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << USBHS_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the USBHS_SYNCBUSY register */
#define USBHS_SYNCBUSY_ENABLE_Pos             _UINT32_(1)                                          /* (USBHS_SYNCBUSY) Enable busy bit Position */
#define USBHS_SYNCBUSY_ENABLE_Msk             (_UINT32_(0x1) << USBHS_SYNCBUSY_ENABLE_Pos)         /* (USBHS_SYNCBUSY) Enable busy bit Mask */
#define USBHS_SYNCBUSY_ENABLE(value)          (USBHS_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << USBHS_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the USBHS_SYNCBUSY register */
#define USBHS_SYNCBUSY_T1MSEN_Pos             _UINT32_(2)                                          /* (USBHS_SYNCBUSY) T1MS enable busy bit Position */
#define USBHS_SYNCBUSY_T1MSEN_Msk             (_UINT32_(0x1) << USBHS_SYNCBUSY_T1MSEN_Pos)         /* (USBHS_SYNCBUSY) T1MS enable busy bit Mask */
#define USBHS_SYNCBUSY_T1MSEN(value)          (USBHS_SYNCBUSY_T1MSEN_Msk & (_UINT32_(value) << USBHS_SYNCBUSY_T1MSEN_Pos)) /* Assigment of value for T1MSEN in the USBHS_SYNCBUSY register */
#define USBHS_SYNCBUSY_Msk                    _UINT32_(0x00000007)                                 /* (USBHS_SYNCBUSY) Register Mask  */


/* -------- USBHS_TESTMODE : (USBHS Offset: 0x100F) (R/W 8) Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation -------- */
#define USBHS_TESTMODE_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_TESTMODE) Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation  Reset Value */

#define USBHS_TESTMODE_TESTSE0NAK_Pos         _UINT8_(0)                                           /* (USBHS_TESTMODE) Set To Enter The Test_SE0_NAK mode Position */
#define USBHS_TESTMODE_TESTSE0NAK_Msk         (_UINT8_(0x1) << USBHS_TESTMODE_TESTSE0NAK_Pos)      /* (USBHS_TESTMODE) Set To Enter The Test_SE0_NAK mode Mask */
#define USBHS_TESTMODE_TESTSE0NAK(value)      (USBHS_TESTMODE_TESTSE0NAK_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTSE0NAK_Pos)) /* Assigment of value for TESTSE0NAK in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_TESTJ_Pos              _UINT8_(1)                                           /* (USBHS_TESTMODE) Set To Enter The Test_J mode Position */
#define USBHS_TESTMODE_TESTJ_Msk              (_UINT8_(0x1) << USBHS_TESTMODE_TESTJ_Pos)           /* (USBHS_TESTMODE) Set To Enter The Test_J mode Mask */
#define USBHS_TESTMODE_TESTJ(value)           (USBHS_TESTMODE_TESTJ_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTJ_Pos)) /* Assigment of value for TESTJ in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_TESTK_Pos              _UINT8_(2)                                           /* (USBHS_TESTMODE) Set To Enter The Test_K mode Position */
#define USBHS_TESTMODE_TESTK_Msk              (_UINT8_(0x1) << USBHS_TESTMODE_TESTK_Pos)           /* (USBHS_TESTMODE) Set To Enter The Test_K mode Mask */
#define USBHS_TESTMODE_TESTK(value)           (USBHS_TESTMODE_TESTK_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTK_Pos)) /* Assigment of value for TESTK in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_TESTPACKET_Pos         _UINT8_(3)                                           /* (USBHS_TESTMODE) Set To Enter The Test_Packet mode Position */
#define USBHS_TESTMODE_TESTPACKET_Msk         (_UINT8_(0x1) << USBHS_TESTMODE_TESTPACKET_Pos)      /* (USBHS_TESTMODE) Set To Enter The Test_Packet mode Mask */
#define USBHS_TESTMODE_TESTPACKET(value)      (USBHS_TESTMODE_TESTPACKET_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTPACKET_Pos)) /* Assigment of value for TESTPACKET in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FORCEHS_Pos            _UINT8_(4)                                           /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into High Speed Mode Position */
#define USBHS_TESTMODE_FORCEHS_Msk            (_UINT8_(0x1) << USBHS_TESTMODE_FORCEHS_Pos)         /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into High Speed Mode Mask */
#define USBHS_TESTMODE_FORCEHS(value)         (USBHS_TESTMODE_FORCEHS_Msk & (_UINT8_(value) << USBHS_TESTMODE_FORCEHS_Pos)) /* Assigment of value for FORCEHS in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FORCEFS_Pos            _UINT8_(5)                                           /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into FS Speed Mode Position */
#define USBHS_TESTMODE_FORCEFS_Msk            (_UINT8_(0x1) << USBHS_TESTMODE_FORCEFS_Pos)         /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into FS Speed Mode Mask */
#define USBHS_TESTMODE_FORCEFS(value)         (USBHS_TESTMODE_FORCEFS_Msk & (_UINT8_(value) << USBHS_TESTMODE_FORCEFS_Pos)) /* Assigment of value for FORCEFS in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FIFOACCESS_Pos         _UINT8_(6)                                           /* (USBHS_TESTMODE) The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically. Position */
#define USBHS_TESTMODE_FIFOACCESS_Msk         (_UINT8_(0x1) << USBHS_TESTMODE_FIFOACCESS_Pos)      /* (USBHS_TESTMODE) The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically. Mask */
#define USBHS_TESTMODE_FIFOACCESS(value)      (USBHS_TESTMODE_FIFOACCESS_Msk & (_UINT8_(value) << USBHS_TESTMODE_FIFOACCESS_Pos)) /* Assigment of value for FIFOACCESS in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FORCEHOST_Pos          _UINT8_(7)                                           /* (USBHS_TESTMODE) The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set Position */
#define USBHS_TESTMODE_FORCEHOST_Msk          (_UINT8_(0x1) << USBHS_TESTMODE_FORCEHOST_Pos)       /* (USBHS_TESTMODE) The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set Mask */
#define USBHS_TESTMODE_FORCEHOST(value)       (USBHS_TESTMODE_FORCEHOST_Msk & (_UINT8_(value) << USBHS_TESTMODE_FORCEHOST_Pos)) /* Assigment of value for FORCEHOST in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_Msk                    _UINT8_(0xFF)                                        /* (USBHS_TESTMODE) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXCSRH : (USBHS Offset: 0x1013) (R/W 8) ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15 -------- */
#define USBHS_ENDPOINTX_TXCSRH_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXCSRH) ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15  Reset Value */

#define USBHS_ENDPOINTX_TXCSRH_MODE_Pos       _UINT8_(5)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The Endpoint Direction As TX Position */
#define USBHS_ENDPOINTX_TXCSRH_MODE_Msk       (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_MODE_Pos)    /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The Endpoint Direction As TX Mask */
#define USBHS_ENDPOINTX_TXCSRH_MODE(value)    (USBHS_ENDPOINTX_TXCSRH_MODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_MODE_Pos)) /* Assigment of value for MODE in the USBHS_ENDPOINTX_TXCSRH register */
#define USBHS_ENDPOINTX_TXCSRH_Msk            _UINT8_(0x20)                                        /* (USBHS_ENDPOINTX_TXCSRH) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packe Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packe Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum P Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Pos) /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum P Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_Msk   _UINT8_(0x9F)                                         /* (USBHS_ENDPOINTX_TXCSRH_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode 1 And Clears It To Select DMA Request Mode 0. Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode 1 And Clears It To Select DMA Request Mode 0. Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packet To Be Cleared From The FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packet To Be Cleared From The FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The TX Endpoint Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The TX Endpoint Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The TX Endpoint For Isochronous Transfers Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The TX Endpoint For Isochronous Transfers Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum Packet Size Is Loaded Into The TX FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Pos) /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum Packet Size Is Loaded Into The TX FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_Msk _UINT8_(0xDC)                                         /* (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXCSRL : (USBHS Offset: 0x1012) (R/W 8) ENDPOINTX Control And Status Bits for TX Endpoints 1-15 -------- */
#define USBHS_ENDPOINTX_TXCSRL_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXCSRL) ENDPOINTX Control And Status Bits for TX Endpoints 1-15  Reset Value */

