Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
#define USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Pos   _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Msk   (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRL_TXPKTRDY(value) (USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Pos)) /* Assigment of value for TXPKTRDY in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY(value) (USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Pos)) /* Assigment of value for FIFONOTEMPTY in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Pos  _UINT8_(3)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO Position */
#define USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Msk  (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO Mask */
#define USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO(value) (USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Pos)) /* Assigment of value for FLUSHFIFO in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Position */
#define USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Mask */
#define USBHS_ENDPOINTX_TXCSRL_CLRDATATOG(value) (USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Pos)) /* Assigment of value for CLRDATATOG in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_Msk            _UINT8_(0x4B)                                        /* (USBHS_ENDPOINTX_TXCSRL) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Received. Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Received. Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_Msk   _UINT8_(0xB4)                                         /* (USBHS_ENDPOINTX_TXCSRL_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit If An In Token Is Received When TxPktRdy Is Not Set. Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit If An In Token Is Received When TxPktRdy Is Not Set. Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Issue A Stall Handshake To An In Token Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Issue A Stall Handshake To An In Token Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Transmitted. Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Transmitted. Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRL) When The Endpoint Is Being Used For High-Bandwidth Isochronous, This Bit Is Set To Indicate Where A Large Packet Has Been Split Into 2 Or 3 Packets For Transmission But Insufficient IN Tokens Have Been Received To Send All The Parts. Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Pos) /* (USBHS_ENDPOINTX_TXCSRL) When The Endpoint Is Being Used For High-Bandwidth Isochronous, This Bit Is Set To Indicate Where A Large Packet Has Been Split Into 2 Or 3 Packets For Transmission But Insufficient IN Tokens Have Been Received To Send All The Parts. Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_Msk _UINT8_(0xB4)                                         /* (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX) Register Mask  */


/* -------- USBHS_TXDPKTBUFDIS : (USBHS Offset: 0x1342) (R/W 16) Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality -------- */
#define USBHS_TXDPKTBUFDIS_RESETVALUE         _UINT16_(0x00)                                       /*  (USBHS_TXDPKTBUFDIS) Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality  Reset Value */

#define USBHS_TXDPKTBUFDIS_EPxTXDIS_Pos       _UINT16_(1)                                          /* (USBHS_TXDPKTBUFDIS) each bit indicates which of the Tx endpoint have disabled double buffer functionality Position */
#define USBHS_TXDPKTBUFDIS_EPxTXDIS_Msk       (_UINT16_(0x7FFF) << USBHS_TXDPKTBUFDIS_EPxTXDIS_Pos) /* (USBHS_TXDPKTBUFDIS) each bit indicates which of the Tx endpoint have disabled double buffer functionality Mask */
#define USBHS_TXDPKTBUFDIS_EPxTXDIS(value)    (USBHS_TXDPKTBUFDIS_EPxTXDIS_Msk & (_UINT16_(value) << USBHS_TXDPKTBUFDIS_EPxTXDIS_Pos)) /* Assigment of value for EPxTXDIS in the USBHS_TXDPKTBUFDIS register */
#define USBHS_TXDPKTBUFDIS_Msk                _UINT16_(0xFFFE)                                     /* (USBHS_TXDPKTBUFDIS) Register Mask  */


/* -------- USBHS_TXFIFOADD : (USBHS Offset: 0x1064) (R/W 16) Controls The Start Address Of the Selected TX Endpoint FIFO -------- */
#define USBHS_TXFIFOADD_RESETVALUE            _UINT16_(0x00)                                       /*  (USBHS_TXFIFOADD) Controls The Start Address Of the Selected TX Endpoint FIFO  Reset Value */

#define USBHS_TXFIFOADD_ADDR_Pos              _UINT16_(0)                                          /* (USBHS_TXFIFOADD) start address of the endpoint FIFO Position */
#define USBHS_TXFIFOADD_ADDR_Msk              (_UINT16_(0x1FFF) << USBHS_TXFIFOADD_ADDR_Pos)       /* (USBHS_TXFIFOADD) start address of the endpoint FIFO Mask */
#define USBHS_TXFIFOADD_ADDR(value)           (USBHS_TXFIFOADD_ADDR_Msk & (_UINT16_(value) << USBHS_TXFIFOADD_ADDR_Pos)) /* Assigment of value for ADDR in the USBHS_TXFIFOADD register */
#define USBHS_TXFIFOADD_Msk                   _UINT16_(0x1FFF)                                     /* (USBHS_TXFIFOADD) Register Mask  */


/* -------- USBHS_TXFIFOSZ : (USBHS Offset: 0x1062) (R/W 8) Controls The Size Of The Selected TX Endpoint FIFO -------- */
#define USBHS_TXFIFOSZ_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_TXFIFOSZ) Controls The Size Of The Selected TX Endpoint FIFO  Reset Value */

#define USBHS_TXFIFOSZ_SZ_Pos                 _UINT8_(0)                                           /* (USBHS_TXFIFOSZ) maximum packet size to be allowed Position */
#define USBHS_TXFIFOSZ_SZ_Msk                 (_UINT8_(0xF) << USBHS_TXFIFOSZ_SZ_Pos)              /* (USBHS_TXFIFOSZ) maximum packet size to be allowed Mask */
#define USBHS_TXFIFOSZ_SZ(value)              (USBHS_TXFIFOSZ_SZ_Msk & (_UINT8_(value) << USBHS_TXFIFOSZ_SZ_Pos)) /* Assigment of value for SZ in the USBHS_TXFIFOSZ register */
#define   USBHS_TXFIFOSZ_SZ_8BYTES_Val        _UINT8_(0x0)                                         /* (USBHS_TXFIFOSZ) 8 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_16BYTES_Val       _UINT8_(0x1)                                         /* (USBHS_TXFIFOSZ) 16 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_32BYTES_Val       _UINT8_(0x2)                                         /* (USBHS_TXFIFOSZ) 32 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_64BYTES_Val       _UINT8_(0x3)                                         /* (USBHS_TXFIFOSZ) 64 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_128BYTES_Val      _UINT8_(0x4)                                         /* (USBHS_TXFIFOSZ) 128 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_256BYTES_Val      _UINT8_(0x5)                                         /* (USBHS_TXFIFOSZ) 256 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_512BYTES_Val      _UINT8_(0x6)                                         /* (USBHS_TXFIFOSZ) 512 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_1024BYTES_Val     _UINT8_(0x7)                                         /* (USBHS_TXFIFOSZ) 1024 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_2048BYTES_Val     _UINT8_(0x8)                                         /* (USBHS_TXFIFOSZ) 2048 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_4096BYTES_Val     _UINT8_(0x9)                                         /* (USBHS_TXFIFOSZ) 4096 BYTES  */
#define USBHS_TXFIFOSZ_SZ_8BYTES              (USBHS_TXFIFOSZ_SZ_8BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 8 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_16BYTES             (USBHS_TXFIFOSZ_SZ_16BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 16 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_32BYTES             (USBHS_TXFIFOSZ_SZ_32BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 32 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_64BYTES             (USBHS_TXFIFOSZ_SZ_64BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 64 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_128BYTES            (USBHS_TXFIFOSZ_SZ_128BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 128 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_256BYTES            (USBHS_TXFIFOSZ_SZ_256BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 256 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_512BYTES            (USBHS_TXFIFOSZ_SZ_512BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 512 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_1024BYTES           (USBHS_TXFIFOSZ_SZ_1024BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 1024 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_2048BYTES           (USBHS_TXFIFOSZ_SZ_2048BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 2048 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_4096BYTES           (USBHS_TXFIFOSZ_SZ_4096BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 4096 BYTES Position  */
#define USBHS_TXFIFOSZ_DPB_Pos                _UINT8_(4)                                           /* (USBHS_TXFIFOSZ) double packet buffering supported or not Position */
#define USBHS_TXFIFOSZ_DPB_Msk                (_UINT8_(0x1) << USBHS_TXFIFOSZ_DPB_Pos)             /* (USBHS_TXFIFOSZ) double packet buffering supported or not Mask */
#define USBHS_TXFIFOSZ_DPB(value)             (USBHS_TXFIFOSZ_DPB_Msk & (_UINT8_(value) << USBHS_TXFIFOSZ_DPB_Pos)) /* Assigment of value for DPB in the USBHS_TXFIFOSZ register */
#define USBHS_TXFIFOSZ_Msk                    _UINT8_(0x1F)                                        /* (USBHS_TXFIFOSZ) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXINTERVAL : (USBHS Offset: 0x101B) (R/W 8) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint. -------- */
#define USBHS_ENDPOINTX_TXINTERVAL_RESETVALUE _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXINTERVAL) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint.  Reset Value */

#define USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXINTERVAL) polling interval Position */
#define USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Msk (_UINT8_(0xFF) << USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Pos) /* (USBHS_ENDPOINTX_TXINTERVAL) polling interval Mask */
#define USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL(value) (USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Pos)) /* Assigment of value for TXPOLLINGINTERVAL in the USBHS_ENDPOINTX_TXINTERVAL register */
#define USBHS_ENDPOINTX_TXINTERVAL_Msk        _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_TXINTERVAL) Register Mask  */


