Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/usbhs.h
/* -------- USBHS_ENDPOINTX_TXMAXP : (USBHS Offset: 0x1010) (R/W 16) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation -------- */
#define USBHS_ENDPOINTX_TXMAXP_RESETVALUE     _UINT16_(0x00)                                       /*  (USBHS_ENDPOINTX_TXMAXP) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation  Reset Value */

#define USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Pos _UINT16_(0)                                          /* (USBHS_ENDPOINTX_TXMAXP) Maximum Payload/Transactions Position */
#define USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Msk (_UINT16_(0x7FF) << USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Pos) /* (USBHS_ENDPOINTX_TXMAXP) Maximum Payload/Transactions Mask */
#define USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD(value) (USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Pos)) /* Assigment of value for MAXPAYLOAD in the USBHS_ENDPOINTX_TXMAXP register */
#define USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Pos _UINT16_(11)                                         /* (USBHS_ENDPOINTX_TXMAXP) Multiplier Value (m-1) Position */
#define USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Msk (_UINT16_(0x1F) << USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Pos) /* (USBHS_ENDPOINTX_TXMAXP) Multiplier Value (m-1) Mask */
#define USBHS_ENDPOINTX_TXMAXP_MULTIPLIER(value) (USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Pos)) /* Assigment of value for MULTIPLIER in the USBHS_ENDPOINTX_TXMAXP register */
#define USBHS_ENDPOINTX_TXMAXP_Msk            _UINT16_(0xFFFF)                                     /* (USBHS_ENDPOINTX_TXMAXP) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXTYPE : (USBHS Offset: 0x101A) (R/W 8) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint -------- */
#define USBHS_ENDPOINTX_TXTYPE_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXTYPE) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint  Reset Value */

#define USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this value to the endpoint number contained in the tx endpoint descriptor Position */
#define USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Pos) /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this value to the endpoint number contained in the tx endpoint descriptor Mask */
#define USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER(value) (USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Pos)) /* Assigment of value for ENDPOINTNUMBER in the USBHS_ENDPOINTX_TXTYPE register */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos   _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this to select the required protocol for the tx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Position */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Msk   (_UINT8_(0x3) << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this to select the required protocol for the tx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Mask */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL(value) (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos)) /* Assigment of value for PROTOCOL in the USBHS_ENDPOINTX_TXTYPE register */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_CONTROL_Val _UINT8_(0x0)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_ISOCHRONOUS_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_BULK_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_INTERRUPT_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_CONTROL (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_CONTROL_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_ISOCHRONOUS (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_ISOCHRONOUS_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_BULK  (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_BULK_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_INTERRUPT (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_INTERRUPT_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_Pos      _UINT8_(6)                                           /* (USBHS_ENDPOINTX_TXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Position */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_Msk      (_UINT8_(0x3) << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos)   /* (USBHS_ENDPOINTX_TXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Mask */
#define USBHS_ENDPOINTX_TXTYPE_SPEED(value)   (USBHS_ENDPOINTX_TXTYPE_SPEED_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_ENDPOINTX_TXTYPE register */
#define   USBHS_ENDPOINTX_TXTYPE_SPEED_HIGH_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_TXTYPE) Device In High Speed  */
#define   USBHS_ENDPOINTX_TXTYPE_SPEED_FULL_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_TXTYPE) Device In Full Speed  */
#define   USBHS_ENDPOINTX_TXTYPE_SPEED_LOW_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_TXTYPE) Device In Low Speed  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_HIGH     (USBHS_ENDPOINTX_TXTYPE_SPEED_HIGH_Val << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_TXTYPE) Device In High Speed Position  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_FULL     (USBHS_ENDPOINTX_TXTYPE_SPEED_FULL_Val << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_TXTYPE) Device In Full Speed Position  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_LOW      (USBHS_ENDPOINTX_TXTYPE_SPEED_LOW_Val << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_TXTYPE) Device In Low Speed Position  */
#define USBHS_ENDPOINTX_TXTYPE_Msk            _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_TXTYPE) Register Mask  */


/* -------- USBHS_ENDPOINT0_TYPE0 : (USBHS Offset: 0x101A) (R/W 8) ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device -------- */
#define USBHS_ENDPOINT0_TYPE0_RESETVALUE      _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_TYPE0) ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device  Reset Value */

#define USBHS_ENDPOINT0_TYPE0_SPEED_Pos       _UINT8_(6)                                           /* (USBHS_ENDPOINT0_TYPE0) Operating Speed Of The Target Device Position */
#define USBHS_ENDPOINT0_TYPE0_SPEED_Msk       (_UINT8_(0x3) << USBHS_ENDPOINT0_TYPE0_SPEED_Pos)    /* (USBHS_ENDPOINT0_TYPE0) Operating Speed Of The Target Device Mask */
#define USBHS_ENDPOINT0_TYPE0_SPEED(value)    (USBHS_ENDPOINT0_TYPE0_SPEED_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_TYPE0_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_ENDPOINT0_TYPE0 register */
#define   USBHS_ENDPOINT0_TYPE0_SPEED_HIGH_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINT0_TYPE0) Device In High Speed  */
#define   USBHS_ENDPOINT0_TYPE0_SPEED_FULL_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINT0_TYPE0) Device In Full Speed  */
#define   USBHS_ENDPOINT0_TYPE0_SPEED_LOW_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINT0_TYPE0) Device In Low Speed  */
#define USBHS_ENDPOINT0_TYPE0_SPEED_HIGH      (USBHS_ENDPOINT0_TYPE0_SPEED_HIGH_Val << USBHS_ENDPOINT0_TYPE0_SPEED_Pos) /* (USBHS_ENDPOINT0_TYPE0) Device In High Speed Position  */
#define USBHS_ENDPOINT0_TYPE0_SPEED_FULL      (USBHS_ENDPOINT0_TYPE0_SPEED_FULL_Val << USBHS_ENDPOINT0_TYPE0_SPEED_Pos) /* (USBHS_ENDPOINT0_TYPE0) Device In Full Speed Position  */
#define USBHS_ENDPOINT0_TYPE0_SPEED_LOW       (USBHS_ENDPOINT0_TYPE0_SPEED_LOW_Val << USBHS_ENDPOINT0_TYPE0_SPEED_Pos) /* (USBHS_ENDPOINT0_TYPE0) Device In Low Speed Position  */
#define USBHS_ENDPOINT0_TYPE0_Msk             _UINT8_(0xC0)                                        /* (USBHS_ENDPOINT0_TYPE0) Register Mask  */


